Samsung/TizenRT/os/arch/xtensa/src/esp32/esp32_rtc_module.c
/******************************************************************
*
* Copyright 2019 Samsung Electronics All Rights Reserved.
*
* Licensed under the Apache License, Version 2.0 (the "License");
* you may not use this file except in compliance with the License.
* You may obtain a copy of the License at
*
*      http://www.apache.org/licenses/LICENSE-2.0
*
* Unless required by applicable law or agreed to in writing, software
* distributed under the License is distributed on an "AS IS" BASIS,
* WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
* See the License for the specific language governing permissions and
* limitations under the License.
*
******************************************************************/

// Copyright 2016-2019 Espressif Systems (Shanghai) PTE LTD
//
// Licensed under the Apache License, Version 2.0 (the "License");
// you may not use this file except in compliance with the License.
// You may obtain a copy of the License at
//
//     http://www.apache.org/licenses/LICENSE-2.0
//
// Unless required by applicable law or agreed to in writing, software
// distributed under the License is distributed on an "AS IS" BASIS,
// WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
// See the License for the specific language governing permissions and
// limitations under the License.

/****************************************************************************
* Included Files
****************************************************************************/
#include <ctype.h>
#include <stdlib.h>
#include <stdio.h>

#include "arch/chip/rtc_io_struct.h"
#include "arch/chip/sens_struct.h"
#include "arch/chip/rtc_cntl_struct.h"
#include "arch/chip/syscon_struct.h"

#include "chip/esp32_syscon_reg.h"
#include "chip/esp32_rtc_cntl_reg.h"
#include "chip/esp32_io_mux_reg.h"
#include "chip/esp32_rtc_io_reg.h"
#include "chip/esp32_rtc_periph.h"
#include "chip/esp32_sens_reg.h"

#include "chip/esp32_rtc_io.h"
#include "chip/esp32_rtc_touch_pad.h"
#include "chip/esp32_rtc_adc.h"
#include "chip/esp32_rtc_dac.h"

#include <arch/board/board.h>
#include <queue.h>
#include <semaphore.h>
#include <errno.h>
#include <tinyara/wdog.h>
#include "esp32_cpuint.h"
#include "irq/irq.h"

/****************************************************************************
* Private Types
****************************************************************************/
typedef sem_t portMUX_TYPE;
typedef sem_t *SemaphoreHandle_t;
typedef sem_t _lock_t;

typedef WDOG_ID TimerHandle_t;

typedef void (*filter_cb_t)(uint16_t *raw_value, uint16_t *filtered_value);

typedef enum {
	GPIO_PULLUP_ONLY,			/*!< Pad pull up            */
	GPIO_PULLDOWN_ONLY,			/*!< Pad pull down          */
	GPIO_PULLUP_PULLDOWN,		/*!< Pad pull up + pull down */
	GPIO_FLOATING,				/*!< Pad floating           */
} gpio_pull_mode_t;

typedef enum {
	ADC_CTRL_RTC = 0,
	ADC_CTRL_ULP = 1,
	ADC_CTRL_DIG = 2,
	ADC2_CTRL_PWDET = 3,
} adc_controller_t;

/******************************************************************************
* macro defination
******************************************************************************/
#define ESP_OK OK
#define ESP_ERR_INVALID_ARG ERROR
#define ESP_ERR_INVALID_STATE ERROR
#define ESP_FAIL ERROR
#define ESP_ERR_NO_MEM ERROR
#define ESP_ERR_TIMEOUT ERROR

#define pdFALSE 0
#define pdTRUE 1

#define portMUX_INITIALIZER_LOCKED { .semcount = 0, .flags = FLAGS_INITIALIZED, }
#define portMUX_INITIALIZER_UNLOCKED { .semcount = 1, .flags = FLAGS_INITIALIZED, }

#define portLOCK_INITIALIZER_LOCKED { .semcount = 0, .flags = FLAGS_INITIALIZED, }
#define portLOCK_INITIALIZER_UNLOCKED { .semcount = 1, .flags = FLAGS_INITIALIZED, }

#define TOUCH_PAD_MAX (10)

#define GPIO_NUM_0  0
#define GPIO_NUM_25 25
#define GPIO_NUM_26 26
#define GPIO_NUM_27 27

#define portMAX_DELAY       0xffffffff

#define RTC_FAST_CLK_FREQ_APPROX APB_CLK_FREQ
#define portTICK_RATE_MS 1000
#define portTICK_PERIOD_MS 1

#define portENTER_CRITICAL(lock) sem_wait(lock)
#define portEXIT_CRITICAL(lock) sem_post(lock)

#define xSemaphoreTake(sem, t) sem_wait(sem)
#define xSemaphoreGive(sem) sem_post(sem)

#define vTaskDelay(t)   usleep(t)

#define _lock_acquire(lock) sem_wait(lock)
#define _lock_release(lock) sem_post(lock)
#define _lock_try_acquire(lock) sem_trywait(lock)

#undef ESP_LOGE
#undef ESP_LOGD
#define ESP_LOGE(TAG, format, ...)
#define ESP_LOGD(TAG, format, ...)


#define GPIO_IS_VALID_GPIO(gpio_num)      ((gpio_num < GPIO_PIN_COUNT && GPIO_PIN_MUX_REG[gpio_num] != 0))	/*!< Check whether it is a valid GPIO number */
#define GPIO_IS_VALID_OUTPUT_GPIO(gpio_num)      ((GPIO_IS_VALID_GPIO(gpio_num)) && (gpio_num < 34))	/*!< Check whether it can be a valid GPIO number of output mode */

#define ADC_FSM_RSTB_WAIT_DEFAULT     (8)
#define ADC_FSM_START_WAIT_DEFAULT    (5)
#define ADC_FSM_STANDBY_WAIT_DEFAULT  (100)
#define ADC_FSM_TIME_KEEP             (-1)
#define ADC_MAX_MEAS_NUM_DEFAULT      (255)
#define ADC_MEAS_NUM_LIM_DEFAULT      (1)
#define SAR_ADC_CLK_DIV_DEFUALT       (2)
#define ADC_PATT_LEN_MAX              (16)
#define TOUCH_PAD_FILTER_FACTOR_DEFAULT   (4)	// IIR filter coefficient.
#define TOUCH_PAD_SHIFT_DEFAULT           (4)	// Increase computing accuracy.
#define TOUCH_PAD_SHIFT_ROUND_DEFAULT     (8)	// ROUND = 2^(n-1); rounding off for fractional.
#define DAC_ERR_STR_CHANNEL_ERROR   "DAC channel error"

#define RTC_MODULE_CHECK(a, str, ret_val) if (!(a)) {                                \
    ESP_LOGE(RTC_MODULE_TAG,"%s:%d (%s):%s", __FILE__, __LINE__, __FUNCTION__, str); \
    return (ret_val);                                                              \
}

#define RTC_RES_CHECK(res, ret_val) if ( (a) != ESP_OK) {                           \
        ESP_LOGE(RTC_MODULE_TAG,"%s:%d (%s)", __FILE__, __LINE__, __FUNCTION__); \
        return (ret_val);                                                              \
}

#define ADC_CHECK_UNIT(unit) RTC_MODULE_CHECK(adc_unit < ADC_UNIT_2, "ADC unit error, only support ADC1 for now", ESP_ERR_INVALID_ARG)

#define ADC1_CHECK_FUNCTION_RET(fun_ret) if(fun_ret!=ESP_OK){\
    ESP_LOGE(RTC_MODULE_TAG,"%s:%d\n",__FUNCTION__,__LINE__);\
    return ESP_FAIL;\
}

#define ADC2_CHECK_FUNCTION_RET(fun_ret) do { if(fun_ret!=ESP_OK){\
    ESP_LOGE(RTC_MODULE_TAG,"%s:%d\n",__FUNCTION__,__LINE__);\
    return ESP_FAIL;\
} }while (0)

#define CONFIG_RTC_GPIO_ENABLE         0
#define CONFIG_RTC_TOUCHPAD_ENABLE     0
#define CONFIG_RTC_ADC_ENABLE          1
#define CONFIG_RTC_DAC_ENABLE          0
#define CONFIG_RTC_HALLSENSOR_ENABLE   0
#define CONFIG_RTC_CORE_ISR_ENABLE     0

#if (CONFIG_RTC_TOUCHPAD_ENABLE > 0) || (CONFIG_RTC_ADC_ENABLE > 0) || (CONFIG_RTC_DAC_ENABLE > 0)
#undef CONFIG_RTC_GPIO_ENABLE
#define CONFIG_RTC_GPIO_ENABLE         1
#endif

#if (CONFIG_RTC_ADC_ENABLE > 0) || (CONFIG_RTC_DAC_ENABLE > 0)
#undef CONFIG_RTC_HALLSENSOR_ENABLE
#define CONFIG_RTC_HALLSENSOR_ENABLE   1
#endif

/****************************************************************************
*
****************************************************************************/
const char *RTC_MODULE_TAG = "RTC_MODULE";
portMUX_TYPE rtc_spinlock = portMUX_INITIALIZER_UNLOCKED;
const uint32_t GPIO_PIN_MUX_REG[GPIO_PIN_COUNT] = {
	IO_MUX_GPIO0_REG,
	IO_MUX_GPIO1_REG,
	IO_MUX_GPIO2_REG,
	IO_MUX_GPIO3_REG,
	IO_MUX_GPIO4_REG,
	IO_MUX_GPIO5_REG,
	IO_MUX_GPIO6_REG,
	IO_MUX_GPIO7_REG,
	IO_MUX_GPIO8_REG,
	IO_MUX_GPIO9_REG,
	IO_MUX_GPIO10_REG,
	IO_MUX_GPIO11_REG,
	IO_MUX_GPIO12_REG,
	IO_MUX_GPIO13_REG,
	IO_MUX_GPIO14_REG,
	IO_MUX_GPIO15_REG,
	IO_MUX_GPIO16_REG,
	IO_MUX_GPIO17_REG,
	IO_MUX_GPIO18_REG,
	IO_MUX_GPIO19_REG,
	0,
	IO_MUX_GPIO21_REG,
	IO_MUX_GPIO22_REG,
	IO_MUX_GPIO23_REG,
	0,
	IO_MUX_GPIO25_REG,
	IO_MUX_GPIO26_REG,
	IO_MUX_GPIO27_REG,
	0,
	0,
	0,
	0,
	IO_MUX_GPIO32_REG,
	IO_MUX_GPIO33_REG,
	IO_MUX_GPIO34_REG,
	IO_MUX_GPIO35_REG,
	IO_MUX_GPIO36_REG,
	IO_MUX_GPIO37_REG,
	IO_MUX_GPIO38_REG,
	IO_MUX_GPIO39_REG,
};

#if (CONFIG_RTC_ADC_ENABLE > 0)
/*
In ADC2, there're two locks used for different cases:
1. lock shared with app and WIFI:
   when wifi using the ADC2, we assume it will never stop,
   so app checks the lock and returns immediately if failed.

2. lock shared between tasks:
   when several tasks sharing the ADC2, we want to guarantee
   all the requests will be handled.
   Since conversions are short (about 31us), app returns the lock very soon,
   we use a spinlock to stand there waiting to do conversions one by one.

adc2_spinlock should be acquired first, then adc2_wifi_lock or rtc_spinlock.
*/
//prevent ADC2 being used by wifi and other tasks at the same time.
static _lock_t adc2_wifi_lock = portLOCK_INITIALIZER_UNLOCKED;;
//prevent ADC2 being used by tasks (regardless of WIFI)
portMUX_TYPE adc2_spinlock = portMUX_INITIALIZER_UNLOCKED;

