Samsung/TizenRT/os/arch/xtensa/src/esp32/esp32_rtc_module.c
//prevent ADC1 being used by I2S dma and other tasks at the same time.
static _lock_t adc1_i2s_lock = portLOCK_INITIALIZER_UNLOCKED;;

static const char ADC_TAG[] = "adc";
#endif

#if (CONFIG_RTC_TOUCHPAD_ENABLE > 0)
static SemaphoreHandle_t rtc_touch_mux = NULL;
typedef struct {
	TimerHandle_t timer;
	uint16_t filtered_val[TOUCH_PAD_MAX];
	uint16_t raw_val[TOUCH_PAD_MAX];
	uint32_t filter_period;
	uint32_t period;
	bool enable;
} touch_pad_filter_t;
static touch_pad_filter_t *s_touch_pad_filter = NULL;
// check if touch pad be inited.
static uint16_t s_touch_pad_init_bit = 0x0000;
static filter_cb_t s_filter_cb = NULL;
#endif

/****************************************************************************
*
****************************************************************************/
#if (CONFIG_RTC_DAC_ENABLE > 0)
static inline void dac_output_set_enable(dac_channel_t channel, bool enable);
#endif
#if (CONFIG_RTC_HALLSENSOR_ENABLE > 0)
static inline void adc1_hall_enable(bool enable);
#endif

/****************************************************************************
* Private Functions
****************************************************************************/

SemaphoreHandle_t xSemaphoreCreateMutex(void)
{
	SemaphoreHandle_t x = malloc(sizeof(sem_t));
	if (x != NULL) {
		sem_init(x, 0, 1);
		sem_setprotocol(x, SEM_PRIO_NONE);
	}
	return x;
}

void vSemaphoreDelete(SemaphoreHandle_t sem)
{
	sem_destroy(sem);
}


#if (CONFIG_RTC_GPIO_ENABLE > 0)
/*---------------------------------------------------------------
                        RTC IO
---------------------------------------------------------------*/
esp_err_t rtc_gpio_init(gpio_num_t gpio_num)
{
	RTC_MODULE_CHECK(rtc_gpio_is_valid_gpio(gpio_num), "RTC_GPIO number error", ESP_ERR_INVALID_ARG);
	portENTER_CRITICAL(&rtc_spinlock);
	// 0: GPIO connected to digital GPIO module. 1: GPIO connected to analog RTC module.
	SET_PERI_REG_MASK(rtc_gpio_desc[gpio_num].reg, (rtc_gpio_desc[gpio_num].mux));
	//0:RTC FUNCIOTN 1,2,3:Reserved
	SET_PERI_REG_BITS(rtc_gpio_desc[gpio_num].reg, RTC_IO_TOUCH_PAD1_FUN_SEL_V, 0x0, rtc_gpio_desc[gpio_num].func);
	portEXIT_CRITICAL(&rtc_spinlock);

	return ESP_OK;
}

esp_err_t rtc_gpio_deinit(gpio_num_t gpio_num)
{
	RTC_MODULE_CHECK(rtc_gpio_is_valid_gpio(gpio_num), "RTC_GPIO number error", ESP_ERR_INVALID_ARG);
	portENTER_CRITICAL(&rtc_spinlock);
	//Select Gpio as Digital Gpio
	CLEAR_PERI_REG_MASK(rtc_gpio_desc[gpio_num].reg, (rtc_gpio_desc[gpio_num].mux));
	portEXIT_CRITICAL(&rtc_spinlock);

	return ESP_OK;
}

static esp_err_t rtc_gpio_output_enable(gpio_num_t gpio_num)
{
	int rtc_gpio_num = rtc_gpio_desc[gpio_num].rtc_num;
	RTC_MODULE_CHECK(rtc_gpio_num != -1, "RTC_GPIO number error", ESP_ERR_INVALID_ARG);
	SET_PERI_REG_MASK(RTC_GPIO_ENABLE_W1TS_REG, (1 << (rtc_gpio_num + RTC_GPIO_ENABLE_W1TS_S)));
	CLEAR_PERI_REG_MASK(RTC_GPIO_ENABLE_W1TC_REG, (1 << (rtc_gpio_num + RTC_GPIO_ENABLE_W1TC_S)));

	return ESP_OK;
}

static esp_err_t rtc_gpio_output_disable(gpio_num_t gpio_num)
{
	int rtc_gpio_num = rtc_gpio_desc[gpio_num].rtc_num;
	RTC_MODULE_CHECK(rtc_gpio_num != -1, "RTC_GPIO number error", ESP_ERR_INVALID_ARG);
	CLEAR_PERI_REG_MASK(RTC_GPIO_ENABLE_W1TS_REG, (1 << (rtc_gpio_num + RTC_GPIO_ENABLE_W1TS_S)));
	SET_PERI_REG_MASK(RTC_GPIO_ENABLE_W1TC_REG, (1 << (rtc_gpio_num + RTC_GPIO_ENABLE_W1TC_S)));

	return ESP_OK;
}

static esp_err_t rtc_gpio_input_enable(gpio_num_t gpio_num)
{
	RTC_MODULE_CHECK(rtc_gpio_is_valid_gpio(gpio_num), "RTC_GPIO number error", ESP_ERR_INVALID_ARG);
	portENTER_CRITICAL(&rtc_spinlock);
	SET_PERI_REG_MASK(rtc_gpio_desc[gpio_num].reg, rtc_gpio_desc[gpio_num].ie);
	portEXIT_CRITICAL(&rtc_spinlock);

	return ESP_OK;
}

static esp_err_t rtc_gpio_input_disable(gpio_num_t gpio_num)
{
	RTC_MODULE_CHECK(rtc_gpio_is_valid_gpio(gpio_num), "RTC_GPIO number error", ESP_ERR_INVALID_ARG);
	portENTER_CRITICAL(&rtc_spinlock);
	CLEAR_PERI_REG_MASK(rtc_gpio_desc[gpio_num].reg, rtc_gpio_desc[gpio_num].ie);
	portEXIT_CRITICAL(&rtc_spinlock);

	return ESP_OK;
}

esp_err_t rtc_gpio_set_level(gpio_num_t gpio_num, uint32_t level)
{
	int rtc_gpio_num = rtc_gpio_num = rtc_gpio_desc[gpio_num].rtc_num;;
	RTC_MODULE_CHECK(rtc_gpio_is_valid_gpio(gpio_num), "RTC_GPIO number error", ESP_ERR_INVALID_ARG);

	if (level) {
		WRITE_PERI_REG(RTC_GPIO_OUT_W1TS_REG, (1 << (rtc_gpio_num + RTC_GPIO_OUT_DATA_W1TS_S)));
	} else {
		WRITE_PERI_REG(RTC_GPIO_OUT_W1TC_REG, (1 << (rtc_gpio_num + RTC_GPIO_OUT_DATA_W1TC_S)));
	}

	return ESP_OK;
}

uint32_t rtc_gpio_get_level(gpio_num_t gpio_num)
{
	uint32_t level = 0;
	int rtc_gpio_num = rtc_gpio_desc[gpio_num].rtc_num;
	RTC_MODULE_CHECK(rtc_gpio_is_valid_gpio(gpio_num), "RTC_GPIO number error", ESP_ERR_INVALID_ARG);

	portENTER_CRITICAL(&rtc_spinlock);
	level = READ_PERI_REG(RTC_GPIO_IN_REG);
	portEXIT_CRITICAL(&rtc_spinlock);
	return ((level >> (RTC_GPIO_IN_NEXT_S + rtc_gpio_num)) & 0x01);
}

esp_err_t rtc_gpio_set_drive_capability(gpio_num_t gpio_num, gpio_drive_cap_t strength)
{
	RTC_MODULE_CHECK(rtc_gpio_is_valid_gpio(gpio_num), "RTC_GPIO number error", ESP_ERR_INVALID_ARG);
	RTC_MODULE_CHECK(GPIO_IS_VALID_OUTPUT_GPIO(gpio_num), "Output pad only", ESP_ERR_INVALID_ARG);
	RTC_MODULE_CHECK(strength < GPIO_DRIVE_CAP_MAX, "GPIO drive capability error", ESP_ERR_INVALID_ARG);

	portENTER_CRITICAL(&rtc_spinlock);
	SET_PERI_REG_BITS(rtc_gpio_desc[gpio_num].reg, rtc_gpio_desc[gpio_num].drv_v, strength, rtc_gpio_desc[gpio_num].drv_s);
	portEXIT_CRITICAL(&rtc_spinlock);
	return ESP_OK;
}

esp_err_t rtc_gpio_get_drive_capability(gpio_num_t gpio_num, gpio_drive_cap_t *strength)
{
	RTC_MODULE_CHECK(rtc_gpio_is_valid_gpio(gpio_num), "RTC_GPIO number error", ESP_ERR_INVALID_ARG);
	RTC_MODULE_CHECK(GPIO_IS_VALID_OUTPUT_GPIO(gpio_num), "Output pad only", ESP_ERR_INVALID_ARG);
	RTC_MODULE_CHECK(strength != NULL, "GPIO drive pointer error", ESP_ERR_INVALID_ARG);

	*strength = GET_PERI_REG_BITS2(rtc_gpio_desc[gpio_num].reg, rtc_gpio_desc[gpio_num].drv_v, rtc_gpio_desc[gpio_num].drv_s);
	return ESP_OK;
}

esp_err_t rtc_gpio_set_direction(gpio_num_t gpio_num, rtc_gpio_mode_t mode)
{
	RTC_MODULE_CHECK(rtc_gpio_is_valid_gpio(gpio_num), "RTC_GPIO number error", ESP_ERR_INVALID_ARG);

