Samsung/TizenRT/os/arch/xtensa/src/esp32/esp32_rtc_module.c
	switch (mode) {
	case RTC_GPIO_MODE_INPUT_ONLY:
		rtc_gpio_output_disable(gpio_num);
		rtc_gpio_input_enable(gpio_num);
		break;
	case RTC_GPIO_MODE_OUTPUT_ONLY:
		rtc_gpio_output_enable(gpio_num);
		rtc_gpio_input_disable(gpio_num);
		break;
	case RTC_GPIO_MODE_INPUT_OUTPUT:
		rtc_gpio_output_enable(gpio_num);
		rtc_gpio_input_enable(gpio_num);
		break;
	case RTC_GPIO_MODE_DISABLED:
		rtc_gpio_output_disable(gpio_num);
		rtc_gpio_input_disable(gpio_num);
		break;
	}

	return ESP_OK;
}

esp_err_t rtc_gpio_pullup_en(gpio_num_t gpio_num)
{
	//this is a digital pad
	if (rtc_gpio_desc[gpio_num].pullup == 0) {
		return ESP_ERR_INVALID_ARG;
	}
	//this is a rtc pad
	portENTER_CRITICAL(&rtc_spinlock);
	SET_PERI_REG_MASK(rtc_gpio_desc[gpio_num].reg, rtc_gpio_desc[gpio_num].pullup);
	portEXIT_CRITICAL(&rtc_spinlock);

	return ESP_OK;
}

esp_err_t rtc_gpio_pulldown_en(gpio_num_t gpio_num)
{
	//this is a digital pad
	if (rtc_gpio_desc[gpio_num].pulldown == 0) {
		return ESP_ERR_INVALID_ARG;
	}
	//this is a rtc pad
	portENTER_CRITICAL(&rtc_spinlock);
	SET_PERI_REG_MASK(rtc_gpio_desc[gpio_num].reg, rtc_gpio_desc[gpio_num].pulldown);
	portEXIT_CRITICAL(&rtc_spinlock);

	return ESP_OK;
}

esp_err_t rtc_gpio_pullup_dis(gpio_num_t gpio_num)
{
	//this is a digital pad
	if (rtc_gpio_desc[gpio_num].pullup == 0) {
		return ESP_ERR_INVALID_ARG;
	}
	//this is a rtc pad
	portENTER_CRITICAL(&rtc_spinlock);
	CLEAR_PERI_REG_MASK(rtc_gpio_desc[gpio_num].reg, rtc_gpio_desc[gpio_num].pullup);
	portEXIT_CRITICAL(&rtc_spinlock);

	return ESP_OK;
}

esp_err_t rtc_gpio_pulldown_dis(gpio_num_t gpio_num)
{
	//this is a digital pad
	if (rtc_gpio_desc[gpio_num].pulldown == 0) {
		return ESP_ERR_INVALID_ARG;
	}
	//this is a rtc pad
	portENTER_CRITICAL(&rtc_spinlock);
	CLEAR_PERI_REG_MASK(rtc_gpio_desc[gpio_num].reg, rtc_gpio_desc[gpio_num].pulldown);
	portEXIT_CRITICAL(&rtc_spinlock);

	return ESP_OK;
}

esp_err_t rtc_gpio_hold_en(gpio_num_t gpio_num)
{
	// check if an RTC IO
	if (rtc_gpio_desc[gpio_num].pullup == 0) {
		return ESP_ERR_INVALID_ARG;
	}
	portENTER_CRITICAL(&rtc_spinlock);
	SET_PERI_REG_MASK(rtc_gpio_desc[gpio_num].reg, rtc_gpio_desc[gpio_num].hold);
	portEXIT_CRITICAL(&rtc_spinlock);
	return ESP_OK;
}

esp_err_t rtc_gpio_hold_dis(gpio_num_t gpio_num)
{
	// check if an RTC IO
	if (rtc_gpio_desc[gpio_num].pullup == 0) {
		return ESP_ERR_INVALID_ARG;
	}
	portENTER_CRITICAL(&rtc_spinlock);
	CLEAR_PERI_REG_MASK(rtc_gpio_desc[gpio_num].reg, rtc_gpio_desc[gpio_num].hold);
	portEXIT_CRITICAL(&rtc_spinlock);
	return ESP_OK;
}

esp_err_t rtc_gpio_isolate(gpio_num_t gpio_num)
{
	if (rtc_gpio_desc[gpio_num].reg == 0) {
		return ESP_ERR_INVALID_ARG;
	}

	rtc_gpio_pullup_dis(gpio_num);
	rtc_gpio_pulldown_dis(gpio_num);
	rtc_gpio_set_direction(gpio_num, RTC_GPIO_MODE_DISABLED);
	rtc_gpio_hold_en(gpio_num);

	return ESP_OK;
}

void rtc_gpio_force_hold_dis_all(void)
{
	for (int gpio = 0; gpio < GPIO_PIN_COUNT; ++gpio) {
		const rtc_gpio_desc_t *desc = &rtc_gpio_desc[gpio];
		if (desc->hold_force != 0) {
			REG_CLR_BIT(RTC_CNTL_HOLD_FORCE_REG, desc->hold_force);
		}
	}
}

esp_err_t rtc_gpio_wakeup_enable(gpio_num_t gpio_num, gpio_int_type_t intr_type)
{
	int rtc_num = rtc_gpio_desc[gpio_num].rtc_num;
	if (rtc_num < 0) {
		return ESP_ERR_INVALID_ARG;
	}
	if ((intr_type != GPIO_INTR_LOW_LEVEL) && (intr_type != GPIO_INTR_HIGH_LEVEL)) {
		return ESP_ERR_INVALID_ARG;
	}

	uint32_t reg = RTC_GPIO_PIN0_REG + rtc_num * sizeof(uint32_t);
	/* each pin has its own register, spinlock not needed */
	REG_SET_BIT(reg, RTC_GPIO_PIN0_WAKEUP_ENABLE);
	REG_SET_FIELD(reg, RTC_GPIO_PIN0_INT_TYPE, intr_type);
	return ESP_OK;
}

esp_err_t rtc_gpio_wakeup_disable(gpio_num_t gpio_num)
{
	int rtc_num = rtc_gpio_desc[gpio_num].rtc_num;
	if (rtc_num < 0) {
		return ESP_ERR_INVALID_ARG;
	}

	uint32_t reg = RTC_GPIO_PIN0_REG + rtc_num * sizeof(uint32_t);
	/* each pin has its own register, spinlock not needed */
	REG_CLR_BIT(reg, RTC_GPIO_PIN0_WAKEUP_ENABLE);
	REG_SET_FIELD(reg, RTC_GPIO_PIN0_INT_TYPE, 0);
	return ESP_OK;
}

esp_err_t gpio_pullup_en(gpio_num_t gpio_num)
{
	RTC_MODULE_CHECK(GPIO_IS_VALID_GPIO(gpio_num), "GPIO number error", ESP_ERR_INVALID_ARG);
	if (RTC_GPIO_IS_VALID_GPIO(gpio_num)) {
		rtc_gpio_pullup_en(gpio_num);
	} else {
		REG_SET_BIT(GPIO_PIN_MUX_REG[gpio_num], FUN_PU);
	}
	return ESP_OK;
}

esp_err_t gpio_pullup_dis(gpio_num_t gpio_num)
{
	RTC_MODULE_CHECK(GPIO_IS_VALID_GPIO(gpio_num), "GPIO number error", ESP_ERR_INVALID_ARG);
	if (RTC_GPIO_IS_VALID_GPIO(gpio_num)) {
		rtc_gpio_pullup_dis(gpio_num);
	} else {
		REG_CLR_BIT(GPIO_PIN_MUX_REG[gpio_num], FUN_PU);
	}
	return ESP_OK;
}

esp_err_t gpio_pulldown_en(gpio_num_t gpio_num)
{
	RTC_MODULE_CHECK(GPIO_IS_VALID_GPIO(gpio_num), "GPIO number error", ESP_ERR_INVALID_ARG);
	if (RTC_GPIO_IS_VALID_GPIO(gpio_num)) {
		rtc_gpio_pulldown_en(gpio_num);
	} else {
		REG_SET_BIT(GPIO_PIN_MUX_REG[gpio_num], FUN_PD);
	}
	return ESP_OK;
}

esp_err_t gpio_pulldown_dis(gpio_num_t gpio_num)
{
	RTC_MODULE_CHECK(GPIO_IS_VALID_GPIO(gpio_num), "GPIO number error", ESP_ERR_INVALID_ARG);
	if (RTC_GPIO_IS_VALID_GPIO(gpio_num)) {
		rtc_gpio_pulldown_dis(gpio_num);
	} else {
		REG_CLR_BIT(GPIO_PIN_MUX_REG[gpio_num], FUN_PD);
	}
	return ESP_OK;
}

esp_err_t gpio_set_pull_mode(gpio_num_t gpio_num, gpio_pull_mode_t pull)
{
	RTC_MODULE_CHECK(GPIO_IS_VALID_GPIO(gpio_num), "GPIO number error", ESP_ERR_INVALID_ARG);
	RTC_MODULE_CHECK(pull <= GPIO_FLOATING, "GPIO pull mode error", ESP_ERR_INVALID_ARG);
	esp_err_t ret = ESP_OK;
	switch (pull) {
	case GPIO_PULLUP_ONLY:
		gpio_pulldown_dis(gpio_num);
		gpio_pullup_en(gpio_num);
		break;
	case GPIO_PULLDOWN_ONLY:
		gpio_pulldown_en(gpio_num);
		gpio_pullup_dis(gpio_num);
		break;
	case GPIO_PULLUP_PULLDOWN:
		gpio_pulldown_en(gpio_num);
		gpio_pullup_en(gpio_num);
		break;
	case GPIO_FLOATING:
		gpio_pulldown_dis(gpio_num);
		gpio_pullup_dis(gpio_num);
		break;
	default:
		ESP_LOGE(RTC_MODULE_TAG, "Unknown pull up/down mode,gpio_num=%u,pull=%u", gpio_num, pull);
		ret = ESP_ERR_INVALID_ARG;
		break;
	}
	return ret;
}
#endif

#if (CONFIG_RTC_TOUCHPAD_ENABLE > 0)
/*---------------------------------------------------------------
                    Touch Pad
---------------------------------------------------------------*/
//Some register bits of touch sensor 8 and 9 are mismatched, we need to swap the bits.
#define BITSWAP(data, n, m)   (((data >> n) &  0x1)  == ((data >> m) & 0x1) ? (data) : ((data) ^ ((0x1 <<n) | (0x1 << m))))
#define TOUCH_BITS_SWAP(v)  BITSWAP(v, TOUCH_PAD_NUM8, TOUCH_PAD_NUM9)
static esp_err_t _touch_pad_read(touch_pad_t touch_num, uint16_t *touch_value, touch_fsm_mode_t mode);

//Some registers of touch sensor 8 and 9 are mismatched, we need to swap register index
inline static touch_pad_t touch_pad_num_wrap(touch_pad_t touch_num)
{
	if (touch_num == TOUCH_PAD_NUM8) {
		return TOUCH_PAD_NUM9;
	} else if (touch_num == TOUCH_PAD_NUM9) {
		return TOUCH_PAD_NUM8;
	}
	return touch_num;
}

esp_err_t touch_pad_isr_register(intr_handler_t fn, void *arg)
{
	RTC_MODULE_CHECK(fn, "Touch_Pad ISR null", ESP_ERR_INVALID_ARG);
	return rtc_isr_register(fn, arg, RTC_CNTL_TOUCH_INT_ST_M);
}

esp_err_t touch_pad_isr_deregister(intr_handler_t fn, void *arg)
{
	return rtc_isr_deregister(fn, arg);
}

static esp_err_t touch_pad_get_io_num(touch_pad_t touch_num, gpio_num_t *gpio_num)
{
	switch (touch_num) {
	case TOUCH_PAD_NUM0:
		*gpio_num = TOUCH_PAD_NUM0_GPIO_NUM;
		break;
	case TOUCH_PAD_NUM1:
		*gpio_num = TOUCH_PAD_NUM1_GPIO_NUM;
		break;
	case TOUCH_PAD_NUM2:
		*gpio_num = TOUCH_PAD_NUM2_GPIO_NUM;
		break;
	case TOUCH_PAD_NUM3:
		*gpio_num = TOUCH_PAD_NUM3_GPIO_NUM;
		break;
	case TOUCH_PAD_NUM4:
		*gpio_num = TOUCH_PAD_NUM4_GPIO_NUM;
		break;
	case TOUCH_PAD_NUM5:
		*gpio_num = TOUCH_PAD_NUM5_GPIO_NUM;
		break;
	case TOUCH_PAD_NUM6:
		*gpio_num = TOUCH_PAD_NUM6_GPIO_NUM;
		break;
	case TOUCH_PAD_NUM7:
		*gpio_num = TOUCH_PAD_NUM7_GPIO_NUM;
		break;
	case TOUCH_PAD_NUM8:
		*gpio_num = TOUCH_PAD_NUM8_GPIO_NUM;
		break;
	case TOUCH_PAD_NUM9:
		*gpio_num = TOUCH_PAD_NUM9_GPIO_NUM;
		break;
	default:
		return ESP_ERR_INVALID_ARG;
	}
	return ESP_OK;
}

static uint32_t _touch_filter_iir(uint32_t in_now, uint32_t out_last, uint32_t k)
{
	if (k == 0) {
		return in_now;
	} else {
		uint32_t out_now = (in_now + (k - 1) * out_last) / k;
		return out_now;
	}
}

