Samsung/TizenRT/os/arch/xtensa/src/esp32/esp32_rtc_module.c
esp_err_t touch_pad_set_filter_read_cb(filter_cb_t read_cb)
{
	s_filter_cb = read_cb;
	return ESP_OK;
}

static void touch_pad_filter_cb(void *arg)
{
	static uint32_t s_filtered_temp[TOUCH_PAD_MAX] = { 0 };

	if (s_touch_pad_filter == NULL || rtc_touch_mux == NULL) {
		return;
	}
	uint16_t val = 0;
	touch_fsm_mode_t mode;
	xSemaphoreTake(rtc_touch_mux, portMAX_DELAY);
	touch_pad_get_fsm_mode(&mode);
	for (int i = 0; i < TOUCH_PAD_MAX; i++) {
		if ((s_touch_pad_init_bit >> i) & 0x1) {
			_touch_pad_read(i, &val, mode);
			s_touch_pad_filter->raw_val[i] = val;
			s_filtered_temp[i] = s_filtered_temp[i] == 0 ? ((uint32_t) val << TOUCH_PAD_SHIFT_DEFAULT) : s_filtered_temp[i];
			s_filtered_temp[i] = _touch_filter_iir((val << TOUCH_PAD_SHIFT_DEFAULT), s_filtered_temp[i], TOUCH_PAD_FILTER_FACTOR_DEFAULT);
			s_touch_pad_filter->filtered_val[i] = (s_filtered_temp[i] + TOUCH_PAD_SHIFT_ROUND_DEFAULT) >> TOUCH_PAD_SHIFT_DEFAULT;
		}
	}
	xTimerReset(s_touch_pad_filter->timer, portMAX_DELAY);
	xSemaphoreGive(rtc_touch_mux);
	if (s_filter_cb != NULL) {
		//return the raw data and filtered data.
		s_filter_cb(s_touch_pad_filter->raw_val, s_touch_pad_filter->filtered_val);
	}
}

esp_err_t touch_pad_set_meas_time(uint16_t sleep_cycle, uint16_t meas_cycle)
{
	xSemaphoreTake(rtc_touch_mux, portMAX_DELAY);
	portENTER_CRITICAL(&rtc_spinlock);
	//touch sensor sleep cycle Time = sleep_cycle / RTC_SLOW_CLK( can be 150k or 32k depending on the options)
	SENS.sar_touch_ctrl2.touch_sleep_cycles = sleep_cycle;
	//touch sensor measure time= meas_cycle / 8Mhz
	SENS.sar_touch_ctrl1.touch_meas_delay = meas_cycle;
	//the waiting cycles (in 8MHz) between TOUCH_START and TOUCH_XPD
	SENS.sar_touch_ctrl1.touch_xpd_wait = TOUCH_PAD_MEASURE_WAIT_DEFAULT;
	portEXIT_CRITICAL(&rtc_spinlock);
	xSemaphoreGive(rtc_touch_mux);
	return ESP_OK;
}

esp_err_t touch_pad_get_meas_time(uint16_t *sleep_cycle, uint16_t *meas_cycle)
{
	portENTER_CRITICAL(&rtc_spinlock);
	if (sleep_cycle) {
		*sleep_cycle = SENS.sar_touch_ctrl2.touch_sleep_cycles;
	}
	if (meas_cycle) {
		*meas_cycle = SENS.sar_touch_ctrl1.touch_meas_delay;
	}
	portEXIT_CRITICAL(&rtc_spinlock);
	return ESP_OK;
}

esp_err_t touch_pad_set_voltage(touch_high_volt_t refh, touch_low_volt_t refl, touch_volt_atten_t atten)
{
	RTC_MODULE_CHECK(((refh < TOUCH_HVOLT_MAX) && (refh >= (int)TOUCH_HVOLT_KEEP)), "touch refh error", ESP_ERR_INVALID_ARG);
	RTC_MODULE_CHECK(((refl < TOUCH_LVOLT_MAX) && (refh >= (int)TOUCH_LVOLT_KEEP)), "touch refl error", ESP_ERR_INVALID_ARG);
	RTC_MODULE_CHECK(((atten < TOUCH_HVOLT_ATTEN_MAX) && (refh >= (int)TOUCH_HVOLT_ATTEN_KEEP)), "touch atten error", ESP_ERR_INVALID_ARG);

	portENTER_CRITICAL(&rtc_spinlock);
	if (refh > TOUCH_HVOLT_KEEP) {
		RTCIO.touch_cfg.drefh = refh;
	}
	if (refl > TOUCH_LVOLT_KEEP) {
		RTCIO.touch_cfg.drefl = refl;
	}
	if (atten > TOUCH_HVOLT_ATTEN_KEEP) {
		RTCIO.touch_cfg.drange = atten;
	}
	portEXIT_CRITICAL(&rtc_spinlock);
	return ESP_OK;
}

esp_err_t touch_pad_get_voltage(touch_high_volt_t *refh, touch_low_volt_t *refl, touch_volt_atten_t *atten)
{
	portENTER_CRITICAL(&rtc_spinlock);
	if (refh) {
		*refh = RTCIO.touch_cfg.drefh;
	}
	if (refl) {
		*refl = RTCIO.touch_cfg.drefl;
	}
	if (atten) {
		*atten = RTCIO.touch_cfg.drange;
	}
	portEXIT_CRITICAL(&rtc_spinlock);
	return ESP_OK;
}

esp_err_t touch_pad_set_cnt_mode(touch_pad_t touch_num, touch_cnt_slope_t slope, touch_tie_opt_t opt)
{
	RTC_MODULE_CHECK((slope < TOUCH_PAD_SLOPE_MAX), "touch slope error", ESP_ERR_INVALID_ARG);
	RTC_MODULE_CHECK((opt < TOUCH_PAD_TIE_OPT_MAX), "touch opt error", ESP_ERR_INVALID_ARG);

	touch_pad_t touch_pad_wrap = touch_pad_num_wrap(touch_num);
	portENTER_CRITICAL(&rtc_spinlock);
	RTCIO.touch_pad[touch_pad_wrap].tie_opt = opt;
	RTCIO.touch_pad[touch_num].dac = slope;
	portEXIT_CRITICAL(&rtc_spinlock);
	return ESP_OK;
}

esp_err_t touch_pad_get_cnt_mode(touch_pad_t touch_num, touch_cnt_slope_t *slope, touch_tie_opt_t *opt)
{
	RTC_MODULE_CHECK((touch_num < TOUCH_PAD_MAX), "touch IO error", ESP_ERR_INVALID_ARG);

	touch_pad_t touch_pad_wrap = touch_pad_num_wrap(touch_num);
	portENTER_CRITICAL(&rtc_spinlock);
	if (opt) {
		*opt = RTCIO.touch_pad[touch_pad_wrap].tie_opt;
	}
	if (slope) {
		*slope = RTCIO.touch_pad[touch_num].dac;
	}
	portEXIT_CRITICAL(&rtc_spinlock);
	return ESP_OK;
}

esp_err_t touch_pad_io_init(touch_pad_t touch_num)
{
	RTC_MODULE_CHECK((touch_num < TOUCH_PAD_MAX), "touch IO error", ESP_ERR_INVALID_ARG);
	gpio_num_t gpio_num = GPIO_NUM_0;
	touch_pad_get_io_num(touch_num, &gpio_num);
	rtc_gpio_init(gpio_num);
	rtc_gpio_set_direction(gpio_num, RTC_GPIO_MODE_DISABLED);
	rtc_gpio_pulldown_dis(gpio_num);
	rtc_gpio_pullup_dis(gpio_num);
	return ESP_OK;
}

esp_err_t touch_pad_set_fsm_mode(touch_fsm_mode_t mode)
{
	RTC_MODULE_CHECK((mode < TOUCH_FSM_MODE_MAX), "touch fsm mode error", ESP_ERR_INVALID_ARG);
	portENTER_CRITICAL(&rtc_spinlock);
	SENS.sar_touch_ctrl2.touch_start_en = 0;
	SENS.sar_touch_ctrl2.touch_start_force = mode;
	RTCCNTL.state0.touch_slp_timer_en = (mode == TOUCH_FSM_MODE_TIMER ? 1 : 0);
	portEXIT_CRITICAL(&rtc_spinlock);
	return ESP_OK;
}

esp_err_t touch_pad_get_fsm_mode(touch_fsm_mode_t *mode)
{
	if (mode) {
		*mode = SENS.sar_touch_ctrl2.touch_start_force;
	}
	return ESP_OK;
}

esp_err_t touch_pad_sw_start()
{
	portENTER_CRITICAL(&rtc_spinlock);
	SENS.sar_touch_ctrl2.touch_start_en = 0;
	SENS.sar_touch_ctrl2.touch_start_en = 1;
	portEXIT_CRITICAL(&rtc_spinlock);
	return ESP_OK;
}

esp_err_t touch_pad_set_thresh(touch_pad_t touch_num, uint16_t threshold)
{
	RTC_MODULE_CHECK((touch_num < TOUCH_PAD_MAX), "touch IO error", ESP_ERR_INVALID_ARG);
	touch_pad_t tp_wrap = touch_pad_num_wrap(touch_num);
	portENTER_CRITICAL(&rtc_spinlock);
	if (tp_wrap & 0x1) {
		SENS.touch_thresh[tp_wrap / 2].l_thresh = threshold;
	} else {
		SENS.touch_thresh[tp_wrap / 2].h_thresh = threshold;
	}
	portEXIT_CRITICAL(&rtc_spinlock);
	return ESP_OK;
}

esp_err_t touch_pad_get_thresh(touch_pad_t touch_num, uint16_t *threshold)
{
	RTC_MODULE_CHECK((touch_num < TOUCH_PAD_MAX), "touch IO error", ESP_ERR_INVALID_ARG);
	touch_pad_t tp_wrap = touch_pad_num_wrap(touch_num);
	if (threshold) {
		*threshold = (tp_wrap & 0x1) ? SENS.touch_thresh[tp_wrap / 2].l_thresh : SENS.touch_thresh[tp_wrap / 2].h_thresh;
	}
	return ESP_OK;
}

esp_err_t touch_pad_set_trigger_mode(touch_trigger_mode_t mode)
{
	RTC_MODULE_CHECK((mode < TOUCH_TRIGGER_MAX), "touch trigger mode error", ESP_ERR_INVALID_ARG);
	portENTER_CRITICAL(&rtc_spinlock);
	SENS.sar_touch_ctrl1.touch_out_sel = mode;
	portEXIT_CRITICAL(&rtc_spinlock);
	return ESP_OK;
}

esp_err_t touch_pad_get_trigger_mode(touch_trigger_mode_t *mode)
{
	if (mode) {
		*mode = SENS.sar_touch_ctrl1.touch_out_sel;
	}
	return ESP_OK;
}

esp_err_t touch_pad_set_trigger_source(touch_trigger_src_t src)
{
	RTC_MODULE_CHECK((src < TOUCH_TRIGGER_SOURCE_MAX), "touch trigger source error", ESP_ERR_INVALID_ARG);
	portENTER_CRITICAL(&rtc_spinlock);
	SENS.sar_touch_ctrl1.touch_out_1en = src;
	portEXIT_CRITICAL(&rtc_spinlock);
	return ESP_OK;
}

esp_err_t touch_pad_get_trigger_source(touch_trigger_src_t *src)
{
	if (src) {
		*src = SENS.sar_touch_ctrl1.touch_out_1en;
	}
	return ESP_OK;
}

esp_err_t touch_pad_set_group_mask(uint16_t set1_mask, uint16_t set2_mask, uint16_t en_mask)
{
	RTC_MODULE_CHECK((set1_mask <= TOUCH_PAD_BIT_MASK_MAX), "touch set1 bitmask error", ESP_ERR_INVALID_ARG);
	RTC_MODULE_CHECK((set2_mask <= TOUCH_PAD_BIT_MASK_MAX), "touch set2 bitmask error", ESP_ERR_INVALID_ARG);
	RTC_MODULE_CHECK((en_mask <= TOUCH_PAD_BIT_MASK_MAX), "touch work_en bitmask error", ESP_ERR_INVALID_ARG);

	portENTER_CRITICAL(&rtc_spinlock);
	SENS.sar_touch_enable.touch_pad_outen1 |= TOUCH_BITS_SWAP(set1_mask);
	SENS.sar_touch_enable.touch_pad_outen2 |= TOUCH_BITS_SWAP(set2_mask);
	SENS.sar_touch_enable.touch_pad_worken |= TOUCH_BITS_SWAP(en_mask);
	portEXIT_CRITICAL(&rtc_spinlock);

	return ESP_OK;
}

