Samsung/TizenRT/os/arch/xtensa/src/esp32/esp32_rtc_module.c
esp_err_t touch_pad_get_group_mask(uint16_t *set1_mask, uint16_t *set2_mask, uint16_t *en_mask)
{
	portENTER_CRITICAL(&rtc_spinlock);
	if (set1_mask) {
		*set1_mask = TOUCH_BITS_SWAP(SENS.sar_touch_enable.touch_pad_outen1);
	}
	if (set2_mask) {
		*set2_mask = TOUCH_BITS_SWAP(SENS.sar_touch_enable.touch_pad_outen2);
	}
	if (en_mask) {
		*en_mask = TOUCH_BITS_SWAP(SENS.sar_touch_enable.touch_pad_worken);
	}
	portEXIT_CRITICAL(&rtc_spinlock);

	return ESP_OK;
}

esp_err_t touch_pad_clear_group_mask(uint16_t set1_mask, uint16_t set2_mask, uint16_t en_mask)
{
	RTC_MODULE_CHECK((set1_mask <= TOUCH_PAD_BIT_MASK_MAX), "touch set1 bitmask error", ESP_ERR_INVALID_ARG);
	RTC_MODULE_CHECK((set2_mask <= TOUCH_PAD_BIT_MASK_MAX), "touch set2 bitmask error", ESP_ERR_INVALID_ARG);
	RTC_MODULE_CHECK((en_mask <= TOUCH_PAD_BIT_MASK_MAX), "touch work_en bitmask error", ESP_ERR_INVALID_ARG);

	portENTER_CRITICAL(&rtc_spinlock);
	SENS.sar_touch_enable.touch_pad_outen1 &= TOUCH_BITS_SWAP(~set1_mask);
	SENS.sar_touch_enable.touch_pad_outen2 &= TOUCH_BITS_SWAP(~set2_mask);
	SENS.sar_touch_enable.touch_pad_worken &= TOUCH_BITS_SWAP(~en_mask);
	portEXIT_CRITICAL(&rtc_spinlock);
	return ESP_OK;
}

#ifndef IRAM_ATTR
#define IRAM_ATTR
#endif
uint32_t IRAM_ATTR touch_pad_get_status()
{
	uint32_t status = SENS.sar_touch_ctrl2.touch_meas_en;
	return TOUCH_BITS_SWAP(status);
}

esp_err_t IRAM_ATTR touch_pad_clear_status()
{
	portENTER_CRITICAL(&rtc_spinlock);
	SENS.sar_touch_ctrl2.touch_meas_en_clr = 1;
	portEXIT_CRITICAL(&rtc_spinlock);
	return ESP_OK;
}

esp_err_t touch_pad_intr_enable()
{
	portENTER_CRITICAL(&rtc_spinlock);
	RTCCNTL.int_ena.rtc_touch = 1;
	portEXIT_CRITICAL(&rtc_spinlock);
	return ESP_OK;
}

esp_err_t touch_pad_intr_disable()
{
	portENTER_CRITICAL(&rtc_spinlock);
	RTCCNTL.int_ena.rtc_touch = 0;
	portEXIT_CRITICAL(&rtc_spinlock);
	return ESP_OK;
}

esp_err_t touch_pad_config(touch_pad_t touch_num, uint16_t threshold)
{
	RTC_MODULE_CHECK(rtc_touch_mux != NULL, "Touch pad not initialized", ESP_FAIL);
	RTC_MODULE_CHECK(touch_num < TOUCH_PAD_MAX, "Touch_Pad Num Err", ESP_ERR_INVALID_ARG);
	touch_fsm_mode_t mode;
	touch_pad_set_thresh(touch_num, threshold);
	touch_pad_io_init(touch_num);
	touch_pad_set_cnt_mode(touch_num, TOUCH_PAD_SLOPE_7, TOUCH_PAD_TIE_OPT_LOW);
	touch_pad_get_fsm_mode(&mode);
	if (TOUCH_FSM_MODE_SW == mode) {
		touch_pad_clear_group_mask((1 << touch_num), (1 << touch_num), (1 << touch_num));
		s_touch_pad_init_bit |= (1 << touch_num);
	} else if (TOUCH_FSM_MODE_TIMER == mode) {
		uint16_t sleep_time = 0;
		uint16_t meas_cycle = 0;
		uint32_t wait_time_ms = 0;
		uint32_t wait_tick = 0;
		uint32_t rtc_clk = rtc_clk_slow_freq_get_hz();
		touch_pad_set_group_mask((1 << touch_num), (1 << touch_num), (1 << touch_num));
		touch_pad_get_meas_time(&sleep_time, &meas_cycle);
		//If the FSM mode is 'TOUCH_FSM_MODE_TIMER', The data will be ready after one measurement cycle
		//after this function is executed, otherwise, the "touch_value" by "touch_pad_read" is 0.
		wait_time_ms = sleep_time / (rtc_clk / 1000) + meas_cycle / (RTC_FAST_CLK_FREQ_APPROX / 1000);
		wait_tick = wait_time_ms / portTICK_RATE_MS;
		vTaskDelay(wait_tick ? wait_tick : 1);
		s_touch_pad_init_bit |= (1 << touch_num);
	} else {
		return ESP_FAIL;
	}
	return ESP_OK;
}

esp_err_t touch_pad_init()
{
	if (rtc_touch_mux == NULL) {
		rtc_touch_mux = xSemaphoreCreateMutex();
	}
	if (rtc_touch_mux == NULL) {
		return ESP_FAIL;
	}
	touch_pad_intr_disable();
	touch_pad_clear_group_mask(TOUCH_PAD_BIT_MASK_MAX, TOUCH_PAD_BIT_MASK_MAX, TOUCH_PAD_BIT_MASK_MAX);
	touch_pad_set_trigger_mode(TOUCH_TRIGGER_MODE_DEFAULT);
	touch_pad_set_trigger_source(TOUCH_TRIGGER_SOURCE_DEFAULT);
	touch_pad_clear_status();
	touch_pad_set_meas_time(TOUCH_PAD_SLEEP_CYCLE_DEFAULT, TOUCH_PAD_MEASURE_CYCLE_DEFAULT);
	touch_pad_set_fsm_mode(TOUCH_FSM_MODE_DEFAULT);
	return ESP_OK;
}

esp_err_t touch_pad_deinit()
{
	RTC_MODULE_CHECK(rtc_touch_mux != NULL, "Touch pad not initialized", ESP_FAIL);
	if (s_touch_pad_filter != NULL) {
		touch_pad_filter_stop();
		touch_pad_filter_delete();
	}
	xSemaphoreTake(rtc_touch_mux, portMAX_DELAY);
	s_touch_pad_init_bit = 0x0000;
	touch_pad_set_fsm_mode(TOUCH_FSM_MODE_SW);
	touch_pad_clear_status();
	touch_pad_intr_disable();
	xSemaphoreGive(rtc_touch_mux);
	vSemaphoreDelete(rtc_touch_mux);
	rtc_touch_mux = NULL;
	return ESP_OK;
}

static esp_err_t _touch_pad_read(touch_pad_t touch_num, uint16_t *touch_value, touch_fsm_mode_t mode)
{
	esp_err_t res = ESP_OK;
	touch_pad_t tp_wrap = touch_pad_num_wrap(touch_num);
	if (TOUCH_FSM_MODE_SW == mode) {
		touch_pad_set_group_mask((1 << touch_num), (1 << touch_num), (1 << touch_num));
		touch_pad_sw_start();
		while (SENS.sar_touch_ctrl2.touch_meas_done == 0) {
		};
		*touch_value = (tp_wrap & 0x1) ? SENS.touch_meas[tp_wrap / 2].l_val : SENS.touch_meas[tp_wrap / 2].h_val;

		touch_pad_clear_group_mask((1 << touch_num), (1 << touch_num), (1 << touch_num));
	} else if (TOUCH_FSM_MODE_TIMER == mode) {
		while (SENS.sar_touch_ctrl2.touch_meas_done == 0) {
		};
		*touch_value = (tp_wrap & 0x1) ? SENS.touch_meas[tp_wrap / 2].l_val : SENS.touch_meas[tp_wrap / 2].h_val;
	} else {
		res = ESP_FAIL;
	}
	if (*touch_value == 0) {
		res = ESP_ERR_INVALID_STATE;
	}
	return res;
}

esp_err_t touch_pad_read(touch_pad_t touch_num, uint16_t *touch_value)
{
	RTC_MODULE_CHECK(touch_num < TOUCH_PAD_MAX, "Touch_Pad Num Err", ESP_ERR_INVALID_ARG);
	RTC_MODULE_CHECK(touch_value != NULL, "touch_value", ESP_ERR_INVALID_ARG);
	RTC_MODULE_CHECK(rtc_touch_mux != NULL, "Touch pad not initialized", ESP_FAIL);

	esp_err_t res = ESP_OK;
	touch_fsm_mode_t mode;
	touch_pad_get_fsm_mode(&mode);
	xSemaphoreTake(rtc_touch_mux, portMAX_DELAY);
	res = _touch_pad_read(touch_num, touch_value, mode);
	xSemaphoreGive(rtc_touch_mux);
	return res;
}

IRAM_ATTR esp_err_t touch_pad_read_raw_data(touch_pad_t touch_num, uint16_t *touch_value)
{
	RTC_MODULE_CHECK(rtc_touch_mux != NULL, "Touch pad not initialized", ESP_FAIL);
	RTC_MODULE_CHECK(touch_num < TOUCH_PAD_MAX, "Touch_Pad Num Err", ESP_ERR_INVALID_ARG);
	RTC_MODULE_CHECK(touch_value != NULL, "touch_value", ESP_ERR_INVALID_ARG);
	RTC_MODULE_CHECK(s_touch_pad_filter != NULL, "Touch pad filter not initialized", ESP_FAIL);
	*touch_value = s_touch_pad_filter->raw_val[touch_num];
	if (*touch_value == 0) {
		return ESP_ERR_INVALID_STATE;
	}
	return ESP_OK;
}

IRAM_ATTR esp_err_t touch_pad_read_filtered(touch_pad_t touch_num, uint16_t *touch_value)
{
	RTC_MODULE_CHECK(rtc_touch_mux != NULL, "Touch pad not initialized", ESP_FAIL);
	RTC_MODULE_CHECK(touch_num < TOUCH_PAD_MAX, "Touch_Pad Num Err", ESP_ERR_INVALID_ARG);
	RTC_MODULE_CHECK(touch_value != NULL, "touch_value", ESP_ERR_INVALID_ARG);
	RTC_MODULE_CHECK(s_touch_pad_filter != NULL, "Touch pad filter not initialized", ESP_FAIL);
	*touch_value = (s_touch_pad_filter->filtered_val[touch_num]);
	if (*touch_value == 0) {
		return ESP_ERR_INVALID_STATE;
	}
	return ESP_OK;
}

esp_err_t touch_pad_set_filter_period(uint32_t new_period_ms)
{
	RTC_MODULE_CHECK(s_touch_pad_filter != NULL, "Touch pad filter not initialized", ESP_ERR_INVALID_STATE);
	RTC_MODULE_CHECK(new_period_ms > 0, "Touch pad filter period error", ESP_ERR_INVALID_ARG);
	RTC_MODULE_CHECK(rtc_touch_mux != NULL, "Touch pad not initialized", ESP_ERR_INVALID_STATE);

	esp_err_t ret = ESP_OK;
	xSemaphoreTake(rtc_touch_mux, portMAX_DELAY);
	if (s_touch_pad_filter != NULL) {
		xTimerChangePeriod(s_touch_pad_filter->timer, new_period_ms / portTICK_PERIOD_MS, portMAX_DELAY);
		s_touch_pad_filter->period = new_period_ms;
	} else {
		ESP_LOGE(RTC_MODULE_TAG, "Touch pad filter deleted");
		ret = ESP_ERR_INVALID_STATE;
	}
	xSemaphoreGive(rtc_touch_mux);
	return ret;
}

esp_err_t touch_pad_get_filter_period(uint32_t *p_period_ms)
{
	RTC_MODULE_CHECK(s_touch_pad_filter != NULL, "Touch pad filter not initialized", ESP_ERR_INVALID_STATE);
	RTC_MODULE_CHECK(p_period_ms != NULL, "Touch pad period pointer error", ESP_ERR_INVALID_ARG);
	RTC_MODULE_CHECK(rtc_touch_mux != NULL, "Touch pad not initialized", ESP_ERR_INVALID_STATE);

	esp_err_t ret = ESP_OK;
	xSemaphoreTake(rtc_touch_mux, portMAX_DELAY);
	if (s_touch_pad_filter != NULL) {
		*p_period_ms = s_touch_pad_filter->period;
	} else {
		ESP_LOGE(RTC_MODULE_TAG, "Touch pad filter deleted");
		ret = ESP_ERR_INVALID_STATE;
	}
	xSemaphoreGive(rtc_touch_mux);
	return ret;
}

esp_err_t touch_pad_filter_start(uint32_t filter_period_ms)
{
	RTC_MODULE_CHECK(filter_period_ms >= portTICK_PERIOD_MS, "Touch pad filter period error", ESP_ERR_INVALID_ARG);
	RTC_MODULE_CHECK(rtc_touch_mux != NULL, "Touch pad not initialized", ESP_ERR_INVALID_STATE);

	esp_err_t ret = ESP_OK;
	xSemaphoreTake(rtc_touch_mux, portMAX_DELAY);
	if (s_touch_pad_filter == NULL) {
		s_touch_pad_filter = (touch_pad_filter_t *) calloc(1, sizeof(touch_pad_filter_t));
		if (s_touch_pad_filter == NULL) {
			ret = ESP_ERR_NO_MEM;
		}
	}
	if (s_touch_pad_filter->timer == NULL) {
		s_touch_pad_filter->timer = xTimerCreate("filter_tmr", filter_period_ms / portTICK_PERIOD_MS, pdFALSE, NULL, touch_pad_filter_cb);
		if (s_touch_pad_filter->timer == NULL) {
			ret = ESP_ERR_NO_MEM;
		}
		s_touch_pad_filter->period = filter_period_ms;
	}
	xSemaphoreGive(rtc_touch_mux);
	touch_pad_filter_cb(NULL);
	return ret;
}

esp_err_t touch_pad_filter_stop()
{
	RTC_MODULE_CHECK(s_touch_pad_filter != NULL, "Touch pad filter not initialized", ESP_ERR_INVALID_STATE);
	RTC_MODULE_CHECK(rtc_touch_mux != NULL, "Touch pad not initialized", ESP_ERR_INVALID_STATE);
	esp_err_t ret = ESP_OK;
	xSemaphoreTake(rtc_touch_mux, portMAX_DELAY);
	if (s_touch_pad_filter != NULL) {
		xTimerStop(s_touch_pad_filter->timer, portMAX_DELAY);
	} else {
		ESP_LOGE(RTC_MODULE_TAG, "Touch pad filter deleted");
		ret = ESP_ERR_INVALID_STATE;
	}
	xSemaphoreGive(rtc_touch_mux);
	return ret;
}

esp_err_t touch_pad_filter_delete()
{
	RTC_MODULE_CHECK(s_touch_pad_filter != NULL, "Touch pad filter not initialized", ESP_ERR_INVALID_STATE);
	RTC_MODULE_CHECK(rtc_touch_mux != NULL, "Touch pad not initialized", ESP_ERR_INVALID_STATE);
	xSemaphoreTake(rtc_touch_mux, portMAX_DELAY);
	if (s_touch_pad_filter != NULL) {
		if (s_touch_pad_filter->timer != NULL) {
			xTimerStop(s_touch_pad_filter->timer, portMAX_DELAY);
			xTimerDelete(s_touch_pad_filter->timer, portMAX_DELAY);
			s_touch_pad_filter->timer = NULL;
		}
		free(s_touch_pad_filter);
		s_touch_pad_filter = NULL;
	}
	xSemaphoreGive(rtc_touch_mux);
	return ESP_OK;
}

esp_err_t touch_pad_get_wakeup_status(touch_pad_t *pad_num)
{
	uint32_t touch_mask = SENS.sar_touch_ctrl2.touch_meas_en;
	if (touch_mask == 0) {
		return ESP_FAIL;
	}
	*pad_num = touch_pad_num_wrap((touch_pad_t)(__builtin_ffs(touch_mask) - 1));
	return ESP_OK;
}
#endif

#if (CONFIG_RTC_ADC_ENABLE > 0)
/*---------------------------------------------------------------
                    ADC Common
---------------------------------------------------------------*/
static esp_err_t adc_set_fsm_time(int rst_wait, int start_wait, int standby_wait, int sample_cycle)
{
	portENTER_CRITICAL(&rtc_spinlock);
	// Internal FSM reset wait time
	if (rst_wait >= 0) {
		SYSCON.saradc_fsm.rstb_wait = rst_wait;
	}
	// Internal FSM start wait time
	if (start_wait >= 0) {
		SYSCON.saradc_fsm.start_wait = start_wait;
	}
	// Internal FSM standby wait time
	if (standby_wait >= 0) {
		SYSCON.saradc_fsm.standby_wait = standby_wait;
	}
	// Internal FSM standby sample cycle
	if (sample_cycle >= 0) {
		SYSCON.saradc_fsm.sample_cycle = sample_cycle;
	}
	portEXIT_CRITICAL(&rtc_spinlock);
	return ESP_OK;
}

