Samsung/TizenRT/os/arch/xtensa/src/esp32/esp32_rtc_module.c
static esp_err_t adc_set_data_format(adc_i2s_encode_t mode)
{
	portENTER_CRITICAL(&rtc_spinlock);
	//data format:
	//0: ADC_ENCODE_12BIT  [15:12]-channel [11:0]-12 bits ADC data
	//1: ADC_ENCODE_11BIT  [15]-1 [14:11]-channel [10:0]-11 bits ADC data, the resolution should not be larger than 11 bits in this case.
	SYSCON.saradc_ctrl.data_sar_sel = mode;
	portEXIT_CRITICAL(&rtc_spinlock);
	return ESP_OK;
}

static esp_err_t adc_set_measure_limit(uint8_t meas_num, bool lim_en)
{
	portENTER_CRITICAL(&rtc_spinlock);
	// Set max measure number
	SYSCON.saradc_ctrl2.max_meas_num = meas_num;
	// Enable max measure number limit
	SYSCON.saradc_ctrl2.meas_num_limit = lim_en;
	portEXIT_CRITICAL(&rtc_spinlock);
	return ESP_OK;
}

static esp_err_t adc_set_work_mode(adc_unit_t adc_unit)
{
	portENTER_CRITICAL(&rtc_spinlock);
	if (adc_unit == ADC_UNIT_1) {
		// saradc mode sel : 0--single saradc;  1--double saradc;  2--alternative saradc
		SYSCON.saradc_ctrl.work_mode = 0;
		//ENABLE ADC  0: ADC1  1: ADC2, only work for single SAR mode
		SYSCON.saradc_ctrl.sar_sel = 0;
	} else if (adc_unit == ADC_UNIT_2) {
		// saradc mode sel : 0--single saradc;  1--double saradc;  2--alternative saradc
		SYSCON.saradc_ctrl.work_mode = 0;
		//ENABLE ADC1  0: SAR1  1: SAR2  only work for single SAR mode
		SYSCON.saradc_ctrl.sar_sel = 1;
	} else if (adc_unit == ADC_UNIT_BOTH) {
		// saradc mode sel : 0--single saradc;  1--double saradc;  2--alternative saradc
		SYSCON.saradc_ctrl.work_mode = 1;
	} else if (adc_unit == ADC_UNIT_ALTER) {
		// saradc mode sel : 0--single saradc;  1--double saradc;  2--alternative saradc
		SYSCON.saradc_ctrl.work_mode = 2;
	}
	portEXIT_CRITICAL(&rtc_spinlock);
	return ESP_OK;
}

static esp_err_t adc_set_atten(adc_unit_t adc_unit, adc_channel_t channel, adc_atten_t atten)
{
	ADC_CHECK_UNIT(adc_unit);
	if (adc_unit & ADC_UNIT_1) {
		RTC_MODULE_CHECK((adc1_channel_t) channel < ADC1_CHANNEL_MAX, "ADC Channel Err", ESP_ERR_INVALID_ARG);
	}
	RTC_MODULE_CHECK(atten < ADC_ATTEN_MAX, "ADC Atten Err", ESP_ERR_INVALID_ARG);

	portENTER_CRITICAL(&rtc_spinlock);
	if (adc_unit & ADC_UNIT_1) {
		//SAR1_atten
		SET_PERI_REG_BITS(SENS_SAR_ATTEN1_REG, SENS_SAR1_ATTEN_VAL_MASK, atten, (channel * 2));
	}
	if (adc_unit & ADC_UNIT_2) {
		//SAR2_atten
		SET_PERI_REG_BITS(SENS_SAR_ATTEN2_REG, SENS_SAR2_ATTEN_VAL_MASK, atten, (channel * 2));
	}
	portEXIT_CRITICAL(&rtc_spinlock);
	return ESP_OK;
}

void adc_power_always_on(void)
{
	portENTER_CRITICAL(&rtc_spinlock);
	SENS.sar_meas_wait2.force_xpd_sar = SENS_FORCE_XPD_SAR_PU;
	portEXIT_CRITICAL(&rtc_spinlock);
}

void adc_power_on(void)
{
	portENTER_CRITICAL(&rtc_spinlock);
	//The power FSM controlled mode saves more power, while the ADC noise may get increased.
#ifndef CONFIG_ADC_FORCE_XPD_FSM
	//Set the power always on to increase precision.
	SENS.sar_meas_wait2.force_xpd_sar = SENS_FORCE_XPD_SAR_PU;
#else
	//Use the FSM to turn off the power while not used to save power.
	if (SENS.sar_meas_wait2.force_xpd_sar & SENS_FORCE_XPD_SAR_SW_M) {
		SENS.sar_meas_wait2.force_xpd_sar = SENS_FORCE_XPD_SAR_PU;
	} else {
		SENS.sar_meas_wait2.force_xpd_sar = SENS_FORCE_XPD_SAR_FSM;
	}
#endif
	portEXIT_CRITICAL(&rtc_spinlock);
}

void adc_power_off(void)
{
	portENTER_CRITICAL(&rtc_spinlock);
	//Bit1  0:Fsm  1: SW mode
	//Bit0  0:SW mode power down  1: SW mode power on
	SENS.sar_meas_wait2.force_xpd_sar = SENS_FORCE_XPD_SAR_PD;
	portEXIT_CRITICAL(&rtc_spinlock);
}

esp_err_t adc_set_clk_div(uint8_t clk_div)
{
	portENTER_CRITICAL(&rtc_spinlock);
	// ADC clock devided from APB clk, 80 / 2 = 40Mhz,
	SYSCON.saradc_ctrl.sar_clk_div = clk_div;
	portEXIT_CRITICAL(&rtc_spinlock);
	return ESP_OK;
}

esp_err_t adc_set_i2s_data_source(adc_i2s_source_t src)
{
	RTC_MODULE_CHECK(src < ADC_I2S_DATA_SRC_MAX, "ADC i2s data source error", ESP_ERR_INVALID_ARG);
	portENTER_CRITICAL(&rtc_spinlock);
	// 1: I2S input data is from SAR ADC (for DMA)  0: I2S input data is from GPIO matrix
	SYSCON.saradc_ctrl.data_to_i2s = src;
	portEXIT_CRITICAL(&rtc_spinlock);
	return ESP_OK;
}

esp_err_t adc_gpio_init(adc_unit_t adc_unit, adc_channel_t channel)
{
	ADC_CHECK_UNIT(adc_unit);
	gpio_num_t gpio_num = 0;
	if (adc_unit & ADC_UNIT_1) {
		RTC_MODULE_CHECK((adc1_channel_t) channel < ADC1_CHANNEL_MAX, "ADC1 channel error", ESP_ERR_INVALID_ARG);
		ADC1_CHECK_FUNCTION_RET(adc1_pad_get_io_num((adc1_channel_t) channel, &gpio_num));
		ADC1_CHECK_FUNCTION_RET(rtc_gpio_init(gpio_num));
		ADC1_CHECK_FUNCTION_RET(rtc_gpio_output_disable(gpio_num));
		ADC1_CHECK_FUNCTION_RET(rtc_gpio_input_disable(gpio_num));
		ADC1_CHECK_FUNCTION_RET(gpio_set_pull_mode(gpio_num, GPIO_FLOATING));
	}
	return ESP_OK;
}

esp_err_t adc_set_data_inv(adc_unit_t adc_unit, bool inv_en)
{
	portENTER_CRITICAL(&rtc_spinlock);
	if (adc_unit & ADC_UNIT_1) {
		// Enable ADC data invert
		SENS.sar_read_ctrl.sar1_data_inv = inv_en;
	}
	if (adc_unit & ADC_UNIT_2) {
		// Enable ADC data invert
		SENS.sar_read_ctrl2.sar2_data_inv = inv_en;
	}
	portEXIT_CRITICAL(&rtc_spinlock);
	return ESP_OK;
}

esp_err_t adc_set_data_width(adc_unit_t adc_unit, adc_bits_width_t bits)
{
	ADC_CHECK_UNIT(adc_unit);
	RTC_MODULE_CHECK(bits < ADC_WIDTH_MAX, "ADC bit width error", ESP_ERR_INVALID_ARG);
	portENTER_CRITICAL(&rtc_spinlock);
	if (adc_unit & ADC_UNIT_1) {
		SENS.sar_start_force.sar1_bit_width = bits;
		SENS.sar_read_ctrl.sar1_sample_bit = bits;
	}
	if (adc_unit & ADC_UNIT_2) {
		SENS.sar_start_force.sar2_bit_width = bits;
		SENS.sar_read_ctrl2.sar2_sample_bit = bits;
	}
	portEXIT_CRITICAL(&rtc_spinlock);
	return ESP_OK;
}

// this function should be called in the critical section
static void adc_set_controller(adc_unit_t unit, adc_controller_t ctrl)
{
	if (unit == ADC_UNIT_1) {
		switch (ctrl) {
		case ADC_CTRL_RTC:
			SENS.sar_read_ctrl.sar1_dig_force = false;	//RTC controller controls the ADC, not digital controller
			SENS.sar_meas_start1.meas1_start_force = true;	//RTC controller controls the ADC,not ulp coprocessor
			SENS.sar_meas_start1.sar1_en_pad_force = true;	//RTC controller controls the data port, not ulp coprocessor
			SENS.sar_touch_ctrl1.xpd_hall_force = true;	// RTC controller controls the hall sensor power,not ulp coprocessor
			SENS.sar_touch_ctrl1.hall_phase_force = true;	// RTC controller controls the hall sensor phase,not ulp coprocessor
			break;
		case ADC_CTRL_ULP:
			SENS.sar_read_ctrl.sar1_dig_force = false;
			SENS.sar_meas_start1.meas1_start_force = false;
			SENS.sar_meas_start1.sar1_en_pad_force = false;
			SENS.sar_touch_ctrl1.xpd_hall_force = false;
			SENS.sar_touch_ctrl1.hall_phase_force = false;
			break;
		case ADC_CTRL_DIG:
			SENS.sar_read_ctrl.sar1_dig_force = true;
			SENS.sar_meas_start1.meas1_start_force = true;
			SENS.sar_meas_start1.sar1_en_pad_force = true;
			SENS.sar_touch_ctrl1.xpd_hall_force = true;
			SENS.sar_touch_ctrl1.hall_phase_force = true;
			break;
		default:
			ESP_LOGE(ADC_TAG, "adc1 selects invalid controller");
			break;
		}
	} else if (unit == ADC_UNIT_2) {
		switch (ctrl) {
		case ADC_CTRL_RTC:
			SENS.sar_meas_start2.meas2_start_force = true;	//RTC controller controls the ADC,not ulp coprocessor
			SENS.sar_meas_start2.sar2_en_pad_force = true;	//RTC controller controls the data port, not ulp coprocessor
			SENS.sar_read_ctrl2.sar2_dig_force = false;	//RTC controller controls the ADC, not digital controller
			SENS.sar_read_ctrl2.sar2_pwdet_force = false;	//RTC controller controls the ADC, not PWDET
			SYSCON.saradc_ctrl.sar2_mux = true;	//RTC controller controls the ADC, not PWDET
			break;
		case ADC_CTRL_ULP:
			SENS.sar_meas_start2.meas2_start_force = false;
			SENS.sar_meas_start2.sar2_en_pad_force = false;
			SENS.sar_read_ctrl2.sar2_dig_force = false;
			SENS.sar_read_ctrl2.sar2_pwdet_force = false;
			SYSCON.saradc_ctrl.sar2_mux = true;
			break;
		case ADC_CTRL_DIG:
			SENS.sar_meas_start2.meas2_start_force = true;
			SENS.sar_meas_start2.sar2_en_pad_force = true;
			SENS.sar_read_ctrl2.sar2_dig_force = true;
			SENS.sar_read_ctrl2.sar2_pwdet_force = false;
			SYSCON.saradc_ctrl.sar2_mux = true;
			break;
		case ADC2_CTRL_PWDET:
			//currently only used by Wi-Fi
			SENS.sar_meas_start2.meas2_start_force = true;
			SENS.sar_meas_start2.sar2_en_pad_force = true;
			SENS.sar_read_ctrl2.sar2_dig_force = false;
			SENS.sar_read_ctrl2.sar2_pwdet_force = true;
			SYSCON.saradc_ctrl.sar2_mux = false;
			break;
		default:
			ESP_LOGE(ADC_TAG, "adc2 selects invalid controller");
			break;
		}
	} else {
		ESP_LOGE(ADC_TAG, "invalid adc unit");
		assert(0);
	}
}

// this function should be called in the critical section
static int adc_convert(adc_unit_t unit, int channel)
{
	uint16_t adc_value;
	if (unit == ADC_UNIT_1) {
		SENS.sar_meas_start1.sar1_en_pad = (1 << channel);	//only one channel is selected.
		while (SENS.sar_slave_addr1.meas_status != 0) ;
		SENS.sar_meas_start1.meas1_start_sar = 0;
		SENS.sar_meas_start1.meas1_start_sar = 1;
		while (SENS.sar_meas_start1.meas1_done_sar == 0) ;
		adc_value = SENS.sar_meas_start1.meas1_data_sar;
	} else if (unit == ADC_UNIT_2) {
		SENS.sar_meas_start2.sar2_en_pad = (1 << channel);	//only one channel is selected.

		SENS.sar_meas_start2.meas2_start_sar = 0;	//start force 0
		SENS.sar_meas_start2.meas2_start_sar = 1;	//start force 1
		while (SENS.sar_meas_start2.meas2_done_sar == 0) {
		};						//read done
		adc_value = SENS.sar_meas_start2.meas2_data_sar;
	} else {
		ESP_LOGE(ADC_TAG, "invalid adc unit");
		return ESP_ERR_INVALID_ARG;
	}
	return adc_value;
}

/*-------------------------------------------------------------------------------------
 *                      ADC I2S
 *------------------------------------------------------------------------------------*/
static esp_err_t adc_set_i2s_data_len(adc_unit_t adc_unit, int patt_len)
{
	ADC_CHECK_UNIT(adc_unit);
	RTC_MODULE_CHECK((patt_len < ADC_PATT_LEN_MAX) && (patt_len > 0), "ADC pattern length error", ESP_ERR_INVALID_ARG);
	portENTER_CRITICAL(&rtc_spinlock);
	if (adc_unit & ADC_UNIT_1) {
		SYSCON.saradc_ctrl.sar1_patt_len = patt_len - 1;
	}
	if (adc_unit & ADC_UNIT_2) {
		SYSCON.saradc_ctrl.sar2_patt_len = patt_len - 1;
	}
	portEXIT_CRITICAL(&rtc_spinlock);
	return ESP_OK;
}

static esp_err_t adc_set_i2s_data_pattern(adc_unit_t adc_unit, int seq_num, adc_channel_t channel, adc_bits_width_t bits, adc_atten_t atten)
{
	ADC_CHECK_UNIT(adc_unit);
	if (adc_unit & ADC_UNIT_1) {
		RTC_MODULE_CHECK((adc1_channel_t) channel < ADC1_CHANNEL_MAX, "ADC1 channel error", ESP_ERR_INVALID_ARG);
	}
	RTC_MODULE_CHECK(bits < ADC_WIDTH_MAX, "ADC bit width error", ESP_ERR_INVALID_ARG);
	RTC_MODULE_CHECK(atten < ADC_ATTEN_MAX, "ADC Atten Err", ESP_ERR_INVALID_ARG);

	portENTER_CRITICAL(&rtc_spinlock);
	//Configure pattern table, each 8 bit defines one channel
	//[7:4]-channel [3:2]-bit width [1:0]- attenuation
	//BIT WIDTH: 3: 12BIT  2: 11BIT  1: 10BIT  0: 9BIT
	//ATTEN: 3: ATTEN = 11dB 2: 6dB 1: 2.5dB 0: 0dB
	uint8_t val = (channel << 4) | (bits << 2) | (atten << 0);
	if (adc_unit & ADC_UNIT_1) {
		SYSCON.saradc_sar1_patt_tab[seq_num / 4] &= (~(0xff << ((3 - (seq_num % 4)) * 8)));
		SYSCON.saradc_sar1_patt_tab[seq_num / 4] |= (val << ((3 - (seq_num % 4)) * 8));
	}
	if (adc_unit & ADC_UNIT_2) {
		SYSCON.saradc_sar2_patt_tab[seq_num / 4] &= (~(0xff << ((3 - (seq_num % 4)) * 8)));
		SYSCON.saradc_sar2_patt_tab[seq_num / 4] |= (val << ((3 - (seq_num % 4)) * 8));
	}
	portEXIT_CRITICAL(&rtc_spinlock);
	return ESP_OK;
}

esp_err_t adc_i2s_mode_init(adc_unit_t adc_unit, adc_channel_t channel)
{
	ADC_CHECK_UNIT(adc_unit);
	if (adc_unit & ADC_UNIT_1) {
		RTC_MODULE_CHECK((adc1_channel_t) channel < ADC1_CHANNEL_MAX, "ADC1 channel error", ESP_ERR_INVALID_ARG);
	}

	uint8_t table_len = 1;
	//POWER ON SAR
	adc_power_always_on();
	adc_gpio_init(adc_unit, channel);
	adc_set_i2s_data_len(adc_unit, table_len);
	adc_set_i2s_data_pattern(adc_unit, 0, channel, ADC_WIDTH_BIT_12, ADC_ATTEN_DB_11);
	portENTER_CRITICAL(&rtc_spinlock);
	if (adc_unit & ADC_UNIT_1) {
		adc_set_controller(ADC_UNIT_1, ADC_CTRL_DIG);
	}
	if (adc_unit & ADC_UNIT_2) {
		adc_set_controller(ADC_UNIT_2, ADC_CTRL_DIG);
	}
	portEXIT_CRITICAL(&rtc_spinlock);
	adc_set_i2s_data_source(ADC_I2S_DATA_SRC_ADC);
	adc_set_clk_div(SAR_ADC_CLK_DIV_DEFUALT);
	// Set internal FSM wait time.
	adc_set_fsm_time(ADC_FSM_RSTB_WAIT_DEFAULT, ADC_FSM_START_WAIT_DEFAULT, ADC_FSM_STANDBY_WAIT_DEFAULT, ADC_FSM_TIME_KEEP);
	adc_set_work_mode(adc_unit);
	adc_set_data_format(ADC_ENCODE_12BIT);
	adc_set_measure_limit(ADC_MAX_MEAS_NUM_DEFAULT, ADC_MEAS_NUM_LIM_DEFAULT);
	//Invert The Level, Invert SAR ADC1 data
	adc_set_data_inv(adc_unit, true);
	return ESP_OK;
}

/*-------------------------------------------------------------------------------------
 *                      ADC1
 *------------------------------------------------------------------------------------*/
esp_err_t adc1_pad_get_io_num(adc1_channel_t channel, gpio_num_t *gpio_num)
{
	RTC_MODULE_CHECK(channel < ADC1_CHANNEL_MAX, "ADC1 Channel Err", ESP_ERR_INVALID_ARG);

	switch (channel) {
	case ADC1_CHANNEL_0:
		*gpio_num = ADC1_CHANNEL_0_GPIO_NUM;
		break;
	case ADC1_CHANNEL_1:
		*gpio_num = ADC1_CHANNEL_1_GPIO_NUM;
		break;
	case ADC1_CHANNEL_2:
		*gpio_num = ADC1_CHANNEL_2_GPIO_NUM;
		break;
	case ADC1_CHANNEL_3:
		*gpio_num = ADC1_CHANNEL_3_GPIO_NUM;
		break;
	case ADC1_CHANNEL_4:
		*gpio_num = ADC1_CHANNEL_4_GPIO_NUM;
		break;
	case ADC1_CHANNEL_5:
		*gpio_num = ADC1_CHANNEL_5_GPIO_NUM;
		break;
	case ADC1_CHANNEL_6:
		*gpio_num = ADC1_CHANNEL_6_GPIO_NUM;
		break;
	case ADC1_CHANNEL_7:
		*gpio_num = ADC1_CHANNEL_7_GPIO_NUM;
		break;
	default:
		return ESP_ERR_INVALID_ARG;
	}

	return ESP_OK;
}

esp_err_t adc1_config_channel_atten(adc1_channel_t channel, adc_atten_t atten)
{
	RTC_MODULE_CHECK(channel < ADC1_CHANNEL_MAX, "ADC Channel Err", ESP_ERR_INVALID_ARG);
	RTC_MODULE_CHECK(atten < ADC_ATTEN_MAX, "ADC Atten Err", ESP_ERR_INVALID_ARG);
	adc_gpio_init(ADC_UNIT_1, channel);
	adc_set_atten(ADC_UNIT_1, channel, atten);
	return ESP_OK;
}

esp_err_t adc1_config_width(adc_bits_width_t width_bit)
{
	RTC_MODULE_CHECK(width_bit < ADC_WIDTH_MAX, "ADC bit width error", ESP_ERR_INVALID_ARG);
	adc_set_data_width(ADC_UNIT_1, width_bit);
	adc_set_data_inv(ADC_UNIT_1, true);
	return ESP_OK;
}

