Samsung/TizenRT/os/arch/xtensa/src/esp32/esp32_rtc_module.c
static inline void adc1_fsm_disable(void)
{
	//channel is set in the  convert function
	SENS.sar_meas_wait2.force_xpd_amp = SENS_FORCE_XPD_AMP_PD;
	//disable FSM, it's only used by the LNA.
	SENS.sar_meas_ctrl.amp_rst_fb_fsm = 0;
	SENS.sar_meas_ctrl.amp_short_ref_fsm = 0;
	SENS.sar_meas_ctrl.amp_short_ref_gnd_fsm = 0;
	SENS.sar_meas_wait1.sar_amp_wait1 = 1;
	SENS.sar_meas_wait1.sar_amp_wait2 = 1;
	SENS.sar_meas_wait2.sar_amp_wait3 = 1;
}

esp_err_t adc1_i2s_mode_acquire(void)
{
	//lazy initialization
	//for i2s, block until acquire the lock
	_lock_acquire(&adc1_i2s_lock);
	ESP_LOGD(RTC_MODULE_TAG, "i2s mode takes adc1 lock.");
	portENTER_CRITICAL(&rtc_spinlock);
	SENS.sar_meas_wait2.force_xpd_sar = SENS_FORCE_XPD_SAR_PU;
	//switch SARADC into DIG channel
	SENS.sar_read_ctrl.sar1_dig_force = 1;
	portEXIT_CRITICAL(&rtc_spinlock);
	return ESP_OK;
}

esp_err_t adc1_adc_mode_acquire(void)
{
	//lazy initialization
	//for adc1, block until acquire the lock
	_lock_acquire(&adc1_i2s_lock);
	ESP_LOGD(RTC_MODULE_TAG, "adc mode takes adc1 lock.");
	portENTER_CRITICAL(&rtc_spinlock);
	// for now the WiFi would use ADC2 and set xpd_sar force on.
	// so we can not reset xpd_sar to fsm mode directly.
	// We should handle this after the synchronization mechanism is established.

	//switch SARADC into RTC channel
	SENS.sar_read_ctrl.sar1_dig_force = 0;
	portEXIT_CRITICAL(&rtc_spinlock);
	return ESP_OK;
}

esp_err_t adc1_lock_release(void)
{
	RTC_MODULE_CHECK((uint32_t *)&adc1_i2s_lock != NULL, "adc1 lock release called before acquire", ESP_ERR_INVALID_STATE);
	// for now the WiFi would use ADC2 and set xpd_sar force on.
	// so we can not reset xpd_sar to fsm mode directly.
	// We should handle this after the synchronization mechanism is established.

	_lock_release(&adc1_i2s_lock);
	ESP_LOGD(RTC_MODULE_TAG, "returns adc1 lock.");
	return ESP_OK;
}

int adc1_get_raw(adc1_channel_t channel)
{
	uint16_t adc_value;
	RTC_MODULE_CHECK(channel < ADC1_CHANNEL_MAX, "ADC Channel Err", ESP_ERR_INVALID_ARG);
	adc1_adc_mode_acquire();
	adc_power_on();

	portENTER_CRITICAL(&rtc_spinlock);
	//disable other peripherals
	adc1_hall_enable(false);
	adc1_fsm_disable();			//currently the LNA is not open, close it by default
	//set controller
	adc_set_controller(ADC_UNIT_1, ADC_CTRL_RTC);
	//start conversion
	adc_value = adc_convert(ADC_UNIT_1, channel);
	portEXIT_CRITICAL(&rtc_spinlock);
	adc1_lock_release();
	return adc_value;
}

int adc1_get_voltage(adc1_channel_t channel)	//Deprecated. Use adc1_get_raw() instead
{
	return adc1_get_raw(channel);
}

void adc1_ulp_enable(void)
{
	adc_power_on();

	portENTER_CRITICAL(&rtc_spinlock);
	adc_set_controller(ADC_UNIT_1, ADC_CTRL_ULP);
	// since most users do not need LNA and HALL with uLP, we disable them here
	// open them in the uLP if needed.
	adc1_fsm_disable();
	adc1_hall_enable(false);
	portEXIT_CRITICAL(&rtc_spinlock);
}

/*---------------------------------------------------------------
                    ADC2
---------------------------------------------------------------*/
esp_err_t adc2_pad_get_io_num(adc2_channel_t channel, gpio_num_t *gpio_num)
{
	RTC_MODULE_CHECK(channel < ADC2_CHANNEL_MAX, "ADC2 Channel Err", ESP_ERR_INVALID_ARG);

	switch (channel) {
	case ADC2_CHANNEL_0:
		*gpio_num = ADC2_CHANNEL_0_GPIO_NUM;
		break;
	case ADC2_CHANNEL_1:
		*gpio_num = ADC2_CHANNEL_1_GPIO_NUM;
		break;
	case ADC2_CHANNEL_2:
		*gpio_num = ADC2_CHANNEL_2_GPIO_NUM;
		break;
	case ADC2_CHANNEL_3:
		*gpio_num = ADC2_CHANNEL_3_GPIO_NUM;
		break;
	case ADC2_CHANNEL_4:
		*gpio_num = ADC2_CHANNEL_4_GPIO_NUM;
		break;
	case ADC2_CHANNEL_5:
		*gpio_num = ADC2_CHANNEL_5_GPIO_NUM;
		break;
	case ADC2_CHANNEL_6:
		*gpio_num = ADC2_CHANNEL_6_GPIO_NUM;
		break;
	case ADC2_CHANNEL_7:
		*gpio_num = ADC2_CHANNEL_7_GPIO_NUM;
		break;
	case ADC2_CHANNEL_8:
		*gpio_num = ADC2_CHANNEL_8_GPIO_NUM;
		break;
	case ADC2_CHANNEL_9:
		*gpio_num = ADC2_CHANNEL_9_GPIO_NUM;
		break;
	default:
		return ESP_ERR_INVALID_ARG;
	}

	return ESP_OK;
}

esp_err_t adc2_wifi_acquire(void)
{
	//lazy initialization
	//for wifi, block until acquire the lock
	_lock_acquire(&adc2_wifi_lock);
	ESP_LOGD(RTC_MODULE_TAG, "Wi-Fi takes adc2 lock.");
	return ESP_OK;
}

esp_err_t adc2_wifi_release(void)
{
	RTC_MODULE_CHECK((uint32_t *)&adc2_wifi_lock != NULL, "wifi release called before acquire", ESP_ERR_INVALID_STATE);

	_lock_release(&adc2_wifi_lock);
	ESP_LOGD(RTC_MODULE_TAG, "Wi-Fi returns adc2 lock.");
	return ESP_OK;
}

static esp_err_t adc2_pad_init(adc2_channel_t channel)
{
	gpio_num_t gpio_num = 0;
	ADC2_CHECK_FUNCTION_RET(adc2_pad_get_io_num(channel, &gpio_num));
	ADC2_CHECK_FUNCTION_RET(rtc_gpio_init(gpio_num));
	ADC2_CHECK_FUNCTION_RET(rtc_gpio_output_disable(gpio_num));
	ADC2_CHECK_FUNCTION_RET(rtc_gpio_input_disable(gpio_num));
	ADC2_CHECK_FUNCTION_RET(gpio_set_pull_mode(gpio_num, GPIO_FLOATING));
	return ESP_OK;
}

esp_err_t adc2_config_channel_atten(adc2_channel_t channel, adc_atten_t atten)
{
	RTC_MODULE_CHECK(channel < ADC2_CHANNEL_MAX, "ADC2 Channel Err", ESP_ERR_INVALID_ARG);
	RTC_MODULE_CHECK(atten <= ADC_ATTEN_11db, "ADC2 Atten Err", ESP_ERR_INVALID_ARG);

	adc2_pad_init(channel);
	portENTER_CRITICAL(&adc2_spinlock);

	//lazy initialization
	//avoid collision with other tasks
	if (_lock_try_acquire(&adc2_wifi_lock) == ERROR) {
		//try the lock, return if failed (wifi using).
		portEXIT_CRITICAL(&adc2_spinlock);
		return ESP_ERR_TIMEOUT;
	}
	SENS.sar_atten2 = (SENS.sar_atten2 & ~(3 << (channel * 2))) | ((atten & 3) << (channel * 2));
	_lock_release(&adc2_wifi_lock);

	portEXIT_CRITICAL(&adc2_spinlock);
	return ESP_OK;
}

static inline void adc2_config_width(adc_bits_width_t width_bit)
{
	portENTER_CRITICAL(&rtc_spinlock);
	//sar_start_force shared with ADC1
	SENS.sar_start_force.sar2_bit_width = width_bit;
	//cct set to the same value with PHY
	SENS.sar_start_force.sar2_pwdet_cct = 4;
	portEXIT_CRITICAL(&rtc_spinlock);

	//Invert the adc value,the Output value is invert
	SENS.sar_read_ctrl2.sar2_data_inv = 1;
	//Set The adc sample width,invert adc value,must digital sar2_bit_width[1:0]=3
	SENS.sar_read_ctrl2.sar2_sample_bit = width_bit;
}

static inline void adc2_dac_disable(adc2_channel_t channel)
{
#ifdef CONFIG_ADC2_DISABLE_DAC
	if (channel == ADC2_CHANNEL_8) {	// the same as DAC channel 1
		dac_output_set_enable(DAC_CHANNEL_1, false);
	} else if (channel == ADC2_CHANNEL_9) {
		dac_output_set_enable(DAC_CHANNEL_2, false);
	}
#endif
}

