Samsung/TizenRT/os/arch/xtensa/src/esp32/esp32_rtc_module.c
//registers in critical section with adc1:
//SENS_SAR_START_FORCE_REG,
esp_err_t adc2_get_raw(adc2_channel_t channel, adc_bits_width_t width_bit, int *raw_out)
{
	uint16_t adc_value = 0;
	RTC_MODULE_CHECK(channel < ADC2_CHANNEL_MAX, "ADC Channel Err", ESP_ERR_INVALID_ARG);

	//in critical section with whole rtc module
	adc_power_on();

	//avoid collision with other tasks
	portENTER_CRITICAL(&adc2_spinlock);
	//lazy initialization
	//try the lock, return if failed (wifi using).
	if (_lock_try_acquire(&adc2_wifi_lock) == -1) {
		portEXIT_CRITICAL(&adc2_spinlock);
		return ESP_ERR_TIMEOUT;
	}
	//disable other peripherals
#ifdef CONFIG_ADC2_DISABLE_DAC
	adc2_dac_disable(channel);
#endif
	// set controller
	// in critical section with whole rtc module
	// because the PWDET use the same registers, place it here.
	adc2_config_width(width_bit);
	adc_set_controller(ADC_UNIT_2, ADC_CTRL_RTC);
	//start converting
	adc_value = adc_convert(ADC_UNIT_2, channel);
	_lock_release(&adc2_wifi_lock);
	portEXIT_CRITICAL(&adc2_spinlock);

	*raw_out = (int)adc_value;
	return ESP_OK;
}

esp_err_t adc2_vref_to_gpio(gpio_num_t gpio)
{
	int channel;
	if (gpio == GPIO_NUM_25) {
		channel = 8;			//Channel 8 bit
	} else if (gpio == GPIO_NUM_26) {
		channel = 9;			//Channel 9 bit
	} else if (gpio == GPIO_NUM_27) {
		channel = 7;			//Channel 7 bit
	} else {
		return ESP_ERR_INVALID_ARG;
	}

	//Configure RTC gpio
	rtc_gpio_init(gpio);
	rtc_gpio_output_disable(gpio);
	rtc_gpio_input_disable(gpio);
	rtc_gpio_pullup_dis(gpio);
	rtc_gpio_pulldown_dis(gpio);
	//force fsm
	adc_power_always_on();		//Select power source of ADC

	RTCCNTL.bias_conf.dbg_atten = 0;	//Check DBG effect outside sleep mode
	//set dtest (MUX_SEL : 0 -> RTC; 1-> vdd_sar2)
	RTCCNTL.test_mux.dtest_rtc = 1;	//Config test mux to route v_ref to ADC2 Channels
	//set ent
	RTCCNTL.test_mux.ent_rtc = 1;
	//set sar2_en_test
	SENS.sar_start_force.sar2_en_test = 1;
	//set sar2 en force
	SENS.sar_meas_start2.sar2_en_pad_force = 1;	//Pad bitmap controlled by SW
	//set en_pad for channels 7,8,9 (bits 0x380)
	SENS.sar_meas_start2.sar2_en_pad = 1 << channel;

	return ESP_OK;
}
#endif

#if (CONFIG_RTC_DAC_ENABLE > 0)
/*---------------------------------------------------------------
                    DAC
---------------------------------------------------------------*/
esp_err_t dac_pad_get_io_num(dac_channel_t channel, gpio_num_t *gpio_num)
{
	RTC_MODULE_CHECK((channel >= DAC_CHANNEL_1) && (channel < DAC_CHANNEL_MAX), DAC_ERR_STR_CHANNEL_ERROR, ESP_ERR_INVALID_ARG);
	RTC_MODULE_CHECK(gpio_num, "Param null", ESP_ERR_INVALID_ARG);

	switch (channel) {
	case DAC_CHANNEL_1:
		*gpio_num = DAC_CHANNEL_1_GPIO_NUM;
		break;
	case DAC_CHANNEL_2:
		*gpio_num = DAC_CHANNEL_2_GPIO_NUM;
		break;
	default:
		return ESP_ERR_INVALID_ARG;
	}

	return ESP_OK;
}

static esp_err_t dac_rtc_pad_init(dac_channel_t channel)
{
	RTC_MODULE_CHECK((channel >= DAC_CHANNEL_1) && (channel < DAC_CHANNEL_MAX), DAC_ERR_STR_CHANNEL_ERROR, ESP_ERR_INVALID_ARG);
	gpio_num_t gpio_num = 0;
	dac_pad_get_io_num(channel, &gpio_num);
	rtc_gpio_init(gpio_num);
	rtc_gpio_output_disable(gpio_num);
	rtc_gpio_input_disable(gpio_num);
	rtc_gpio_pullup_dis(gpio_num);
	rtc_gpio_pulldown_dis(gpio_num);

	return ESP_OK;
}

static inline void dac_output_set_enable(dac_channel_t channel, bool enable)
{
	RTCIO.pad_dac[channel - DAC_CHANNEL_1].dac_xpd_force = enable;
	RTCIO.pad_dac[channel - DAC_CHANNEL_1].xpd_dac = enable;
}

esp_err_t dac_output_enable(dac_channel_t channel)
{
	RTC_MODULE_CHECK((channel >= DAC_CHANNEL_1) && (channel < DAC_CHANNEL_MAX), DAC_ERR_STR_CHANNEL_ERROR, ESP_ERR_INVALID_ARG);
	dac_rtc_pad_init(channel);
	portENTER_CRITICAL(&rtc_spinlock);
	dac_output_set_enable(channel, true);
	portEXIT_CRITICAL(&rtc_spinlock);

	return ESP_OK;
}

esp_err_t dac_output_disable(dac_channel_t channel)
{
	RTC_MODULE_CHECK((channel >= DAC_CHANNEL_1) && (channel < DAC_CHANNEL_MAX), DAC_ERR_STR_CHANNEL_ERROR, ESP_ERR_INVALID_ARG);
	portENTER_CRITICAL(&rtc_spinlock);
	dac_output_set_enable(channel, false);
	portEXIT_CRITICAL(&rtc_spinlock);

	return ESP_OK;
}

esp_err_t dac_output_voltage(dac_channel_t channel, uint8_t dac_value)
{
	RTC_MODULE_CHECK((channel >= DAC_CHANNEL_1) && (channel < DAC_CHANNEL_MAX), DAC_ERR_STR_CHANNEL_ERROR, ESP_ERR_INVALID_ARG);
	portENTER_CRITICAL(&rtc_spinlock);
	//Disable Tone
	CLEAR_PERI_REG_MASK(SENS_SAR_DAC_CTRL1_REG, SENS_SW_TONE_EN);

	//Disable Channel Tone
	if (channel == DAC_CHANNEL_1) {
		CLEAR_PERI_REG_MASK(SENS_SAR_DAC_CTRL2_REG, SENS_DAC_CW_EN1_M);
	} else if (channel == DAC_CHANNEL_2) {
		CLEAR_PERI_REG_MASK(SENS_SAR_DAC_CTRL2_REG, SENS_DAC_CW_EN2_M);
	}
	//Set the Dac value
	if (channel == DAC_CHANNEL_1) {
		SET_PERI_REG_BITS(RTC_IO_PAD_DAC1_REG, RTC_IO_PDAC1_DAC, dac_value, RTC_IO_PDAC1_DAC_S);	//dac_output
	} else if (channel == DAC_CHANNEL_2) {
		SET_PERI_REG_BITS(RTC_IO_PAD_DAC2_REG, RTC_IO_PDAC2_DAC, dac_value, RTC_IO_PDAC2_DAC_S);	//dac_output
	}

	portEXIT_CRITICAL(&rtc_spinlock);

	return ESP_OK;
}

esp_err_t dac_out_voltage(dac_channel_t channel, uint8_t dac_value)
{
	RTC_MODULE_CHECK((channel >= DAC_CHANNEL_1) && (channel < DAC_CHANNEL_MAX), DAC_ERR_STR_CHANNEL_ERROR, ESP_ERR_INVALID_ARG);
	portENTER_CRITICAL(&rtc_spinlock);
	//Disable Tone
	CLEAR_PERI_REG_MASK(SENS_SAR_DAC_CTRL1_REG, SENS_SW_TONE_EN);

	//Disable Channel Tone
	if (channel == DAC_CHANNEL_1) {
		CLEAR_PERI_REG_MASK(SENS_SAR_DAC_CTRL2_REG, SENS_DAC_CW_EN1_M);
	} else if (channel == DAC_CHANNEL_2) {
		CLEAR_PERI_REG_MASK(SENS_SAR_DAC_CTRL2_REG, SENS_DAC_CW_EN2_M);
	}
	//Set the Dac value
	if (channel == DAC_CHANNEL_1) {
		SET_PERI_REG_BITS(RTC_IO_PAD_DAC1_REG, RTC_IO_PDAC1_DAC, dac_value, RTC_IO_PDAC1_DAC_S);	//dac_output
	} else if (channel == DAC_CHANNEL_2) {
		SET_PERI_REG_BITS(RTC_IO_PAD_DAC2_REG, RTC_IO_PDAC2_DAC, dac_value, RTC_IO_PDAC2_DAC_S);	//dac_output
	}

	portEXIT_CRITICAL(&rtc_spinlock);
	//dac pad init
	dac_rtc_pad_init(channel);
	dac_output_enable(channel);

	return ESP_OK;
}

esp_err_t dac_i2s_enable(void)
{
	portENTER_CRITICAL(&rtc_spinlock);
	SET_PERI_REG_MASK(SENS_SAR_DAC_CTRL1_REG, SENS_DAC_DIG_FORCE_M | SENS_DAC_CLK_INV_M);
	portEXIT_CRITICAL(&rtc_spinlock);
	return ESP_OK;
}

esp_err_t dac_i2s_disable(void)
{
	portENTER_CRITICAL(&rtc_spinlock);
	CLEAR_PERI_REG_MASK(SENS_SAR_DAC_CTRL1_REG, SENS_DAC_DIG_FORCE_M | SENS_DAC_CLK_INV_M);
	portEXIT_CRITICAL(&rtc_spinlock);
	return ESP_OK;
}
#endif

