Samsung/TizenRT/os/arch/xtensa/src/esp32/esp32_rtc_module.c
#if (CONFIG_RTC_HALLSENSOR_ENABLE > 0)
/*---------------------------------------------------------------
                        HALL SENSOR
---------------------------------------------------------------*/

static inline void adc1_hall_enable(bool enable)
{
	RTCIO.hall_sens.xpd_hall = enable;
}

static int hall_sensor_get_value(void)	//hall sensor without LNA
{
	int Sens_Vp0;
	int Sens_Vn0;
	int Sens_Vp1;
	int Sens_Vn1;
	int hall_value;

	adc_power_on();

	portENTER_CRITICAL(&rtc_spinlock);
	//disable other peripherals
	adc1_fsm_disable();			//currently the LNA is not open, close it by default
	adc1_hall_enable(true);
	// set controller
	adc_set_controller(ADC_UNIT_1, ADC_CTRL_RTC);
	// convert for 4 times with different phase and outputs
	RTCIO.hall_sens.hall_phase = 0;	// hall phase
	Sens_Vp0 = adc_convert(ADC_UNIT_1, ADC1_CHANNEL_0);
	Sens_Vn0 = adc_convert(ADC_UNIT_1, ADC1_CHANNEL_3);
	RTCIO.hall_sens.hall_phase = 1;
	Sens_Vp1 = adc_convert(ADC_UNIT_1, ADC1_CHANNEL_0);
	Sens_Vn1 = adc_convert(ADC_UNIT_1, ADC1_CHANNEL_3);
	portEXIT_CRITICAL(&rtc_spinlock);
	hall_value = (Sens_Vp1 - Sens_Vp0) - (Sens_Vn1 - Sens_Vn0);

	return hall_value;
}

int hall_sensor_read(void)
{
	adc_gpio_init(ADC_UNIT_1, ADC1_CHANNEL_0);
	adc_gpio_init(ADC_UNIT_1, ADC1_CHANNEL_3);
	adc1_config_channel_atten(ADC1_CHANNEL_0, ADC_ATTEN_DB_0);
	adc1_config_channel_atten(ADC1_CHANNEL_3, ADC_ATTEN_DB_0);
	return hall_sensor_get_value();
}
#endif

#if (CONFIG_RTC_CORE_ISR_ENABLE > 0)
/*---------------------------------------------------------------
                        INTERRUPT HANDLER
---------------------------------------------------------------*/
typedef struct rtc_isr_handler_ {
	unsigned int mask;
	intr_handler_t handler;
	void *handler_arg;
	struct rtc_isr_handler_ *next;
} rtc_isr_handler_t;

typedef struct rtc_isr_handler_list_ {
	rtc_isr_handler_t *slh_first;	/* first element */
} rtc_isr_handler_list_t;

portMUX_TYPE s_rtc_isr_handler_list_lock = portMUX_INITIALIZER_UNLOCKED;
static rtc_isr_handler_list_t s_rtc_isr_handler_list = { NULL };

static int rtc_isr(int irq, FAR void *context, void *arg)
{
	uint32_t status = REG_READ(RTC_CNTL_INT_ST_REG);
	rtc_isr_handler_t *it;
	portENTER_CRITICAL(&s_rtc_isr_handler_list_lock);
	//SLIST_FOREACH(it, &s_rtc_isr_handler_list, next) {
	for (it = s_rtc_isr_handler_list.slh_first; it != NULL; it = it->next) {
		if (it->mask & status) {
			portEXIT_CRITICAL(&s_rtc_isr_handler_list_lock);
			(*it->handler)(it->handler_arg);
			portENTER_CRITICAL(&s_rtc_isr_handler_list_lock);
		}
	}
	portEXIT_CRITICAL(&s_rtc_isr_handler_list_lock);
	REG_WRITE(RTC_CNTL_INT_CLR_REG, status);
	return OK;
}

static esp_err_t rtc_isr_ensure_installed(void)
{
	/*register isr */
	const int intrupt_level = 1;
	int cpu_int = esp32_alloc_levelint(intrupt_level);
	if (cpu_int < 0) {
		/* Failed to allocate a CPU interrupt of this type */
		return cpu_int;
	}

	/* Set up to receive peripheral interrupts on the current CPU */
	int cpu = 1;
#ifdef CONFIG_SMP
	cpu = up_cpu_index();
#else
	cpu = 0;
#endif

	/* Attach the GPIO peripheral to the allocated CPU interrupt */
	up_disable_irq(cpu_int);
	esp32_attach_peripheral(cpu, ESP32_PERIPH_RTC_CORE, cpu_int);

	/* Attach and enable the IRQ */
	int ret = irq_attach(ESP32_IRQ_RTC_CORE, &rtc_isr, NULL);
	if (ret == OK) {
		/* Enable the CPU interrupt */
		up_enable_irq(cpu_int);
	}
	return ret;
}

esp_err_t rtc_isr_register(intr_handler_t handler, void *handler_arg, uint32_t rtc_intr_mask)
{
	esp_err_t err = rtc_isr_ensure_installed();
	if (err != ESP_OK) {
		return err;
	}

	rtc_isr_handler_t *item = malloc(sizeof(rtc_isr_handler_t));
	if (item == NULL) {
		return ESP_ERR_NO_MEM;
	}
	item->handler = handler;
	item->handler_arg = handler_arg;
	item->mask = rtc_intr_mask;
	portENTER_CRITICAL(&s_rtc_isr_handler_list_lock);
	//SLIST_INSERT_HEAD(&s_rtc_isr_handler_list, item, next);
	item->next = s_rtc_isr_handler_list.slh_first->next;
	s_rtc_isr_handler_list.slh_first = item;
	portEXIT_CRITICAL(&s_rtc_isr_handler_list_lock);
	return ESP_OK;
}

esp_err_t rtc_isr_deregister(intr_handler_t handler, void *handler_arg)
{
	rtc_isr_handler_t *it;
	rtc_isr_handler_t *prev = NULL;
	bool found = false;
	portENTER_CRITICAL(&s_rtc_isr_handler_list_lock);
	//SLIST_FOREACH(it, &s_rtc_isr_handler_list, next) {
	for (it = s_rtc_isr_handler_list.slh_first; it != NULL; it = it->next) {
		if (it->handler == handler && it->handler_arg == handler_arg) {
			//if (it == SLIST_FIRST(&s_rtc_isr_handler_list)) {
			if (it == s_rtc_isr_handler_list.slh_first) {
				//SLIST_REMOVE_HEAD(&s_rtc_isr_handler_list, next);
				s_rtc_isr_handler_list.slh_first = s_rtc_isr_handler_list.slh_first->next;
				it->next = NULL;
			} else {
				//SLIST_REMOVE_AFTER(prev, next);
				prev->next = it->next;
				it->next = NULL;
			}
			found = true;
			free(it);
			break;
		}
		prev = it;
	}
	portEXIT_CRITICAL(&s_rtc_isr_handler_list_lock);
	return found ? ESP_OK : ESP_ERR_INVALID_STATE;
}

#endif
